<!DOCTYPE html>
<html lang="en">
    <head>
        <title>Inserare</title>
        <style>
            .titlu {
                padding: 8px;
                margin: 25px;

                /* other styling */
                background-color: #33475b;
                border-radius: 10px;
                color: white;
                font-family: colibri;
                font-size: 20pt;
            }
        </style>

        <meta charset="utf-8"> 
        
    </head>
    <body>
        <PageTitle style="text-align:center">
            <u>
                <h1>F I &#350;  A  Nr. 4</h1>
                <h2> Inserarea diferitelor elemente &#238;n pagin&#259;</h2>
            </u>
        </PageTitle><br>

        <ol type="1">
            <li class="titlu"  id="f4_1">1. Inserarea notelor de subsol.</li>
            <p> Se pot insera note de subsol la nivel de pagin&#259; (Footnote) şi note de subsol la nivel de document (Endnote):</p>
                <ul>
                    <li> Pentru a insera o not&#259; de subsol la nivel de pagin&#259;, select&#259;m cuvântul pe care vrem s&#259; îl coment&#259;m.<br>Pe fila <b>Referințe</b> (References) &#238;n grupul <b>Note de subsol</b>(Footnotes) vom ap&#259;sa butonul <b>Insera&#355;i not&#259; de subsol</b>(Insert Footnote)<br><img src="imagini/note_subsol_4_1.png"> <br>se insereaz&#259; nota de subsol dorit&#259;: <br><img src="imagini/note_subsol_4_2.png">
                    </li>
                    <li>
                        Dac&#259; vom &#355;ine mouse-ul în dreptul cuvântului c&#259;ruia i-am f&#259;cut referire la o not&#259; de subsol, putem observa într-un tooltip ce text se reg&#259;seşte în nota de subsol:<br><img src="imagini/note_subsol_4_3.png">
                    </li>
                    <li>Pentru inserarea unei note de subsol la nivel de document se va ap&#259;sa butonul <b>Introduce&#355;i not&#259; de final</b>(Insert Endnote).<br><img src="imagini/note_subsol_4_4.png"><br> Aceast&#259; not&#259; va ap&#259;rea la sfârşitul documentului, iar numerotarea ei se va face automat cu litere.<br><img src="imagini/note_subsol_4_5.png">
                    </li>
                    <li> Pentru a naviga între notele de subsol, putem ap&#259;sa butonul <b>Afișați note</b>(Show Notes) pentru a merge fie la <b>Vezi note de final</b>(View endnote area) fie la <b>Vezi note de subsol</b>(View footnote area).<br><img src="imagini/note_subsol_4_6.png">
                    </li>        
                </ul>              

            <li class="titlu" id="f4_2">2. Introducerea unui marcaj într-un document Word.</li>
            <p>Când aveți un document Microsoft Word lung și trebuie s&#259; v&#259; întoarceți la anumite locații din document mai târziu pentru editare marcajele sunt foarte utile. În loc s&#259; derulați pagin&#259; dup&#259; pagin&#259; documentul, puteți reveni rapid la locațiile marcate pentru a v&#259; relua activitatea.
            </p>
            <p>Poziționați cursorul la un punct de inserare pe care doriți s&#259; îl marcați sau selectați o secțiune de text sau o imagine.
                Pe fila <b>Inserare</b> (Insert) &#238;n grupul <b>Leg&#259;turi</b>(Links)<br><img src="imagini/bookmark_4_7.png"><br> Selectați "Bookmark" în secțiunea Leg&#259;turi pentru a deschide caseta de dialog Bookmark <br><img src="imagini/bookmark_4_8.png"><br>În caseta "Nume", introduceți un nume pentru marcaj. Trebuie s&#259; înceap&#259; cu o liter&#259; și s&#259; nu poat&#259; conține spații, dar puteți utiliza caracterul de subliniere pentru a separa cuvintele. Dac&#259; intenționați s&#259; introduceți mai multe marcaje, faceți numele suficient de descriptiv pentru a fi ușor de recunoscut.Apoi faceți clic pe <b>Ad&#259;ugați</b>(Add) pentru a plasa marcajul.
            </p>

            <li class="titlu" id="f4_3">3. Vizualizarea marcajelor într-un document.</li>
                <ul>Microsoft Word nu afișeaz&#259; marcajele în mod implicit. Pentru a vedea marcajele din document, trebuie s&#259;:
                    <li>Face&#355;i clic pe <b>Fișier</b>(File) și apoi clic pe <b>Opțiuni</b>(Options).<br><img src="imagini/bookmark_4_9.png"></li>
                    <li>Selectați <b>Avansat</b>(Advanced) apoi bifați caseta de lâng&#259; <b>Afișați marcajele</b>(Show bookmarks) din secțiunea <b>Afișare conținut documente</b>(Show documents content) <br><img src="imagini/bookmark_4_10.png"></li>
                    <li>Textul sau imaginea marcat&#259; trebuie s&#259; apar&#259; acum &#238;n paranteze &#238;n document.<br><img src="imagini/bookmark_4_11.png"> </li>
                </ul> 
            
            <li class="titlu" id="f4_4">4. Crearea unui hyperlink la o locație din documentul curent.</li>
            <ul>
                <li>Selectați textul sau imaginea care doriți s&#259; se afișeze ca hyperlink,</li>
                <li>&#206;n fila <b>Inserare</b> (Insert) &#238;n grupul  <b>Leg&#259;turi</b>(Links) face&#355;i clic pe <b>Leg&#259;turi</b> (Hyperlinks)<br><img src="imagini/link_4_12.png"></li>
                <li>&#351;i &#238;n fereastra care apare selecta&#355;i <b>Plasare în acest document</b>(Place in This Document),<br><img src="imagini/link_4_13.png"> </li>
                <li>În list&#259;, selectați titlul (doar documentul curent), titlul marcajul în document(Bookmarks) la care doriți s&#259; creați leg&#259;tura,<br><img src="imagini/link_4_14.png"></li>
            </ul>
            
            <li class="titlu" id="f4_5">5. Crearea unui hyperlink la alt document.</li>
            <ul>
                <li>Selectați textul sau imaginea care doriți s&#259; se afișeze ca hyperlink,</li>
                <li>&#206;n fila <b>Inserare</b> (Insert) &#238;n grupul  <b>Leg&#259;turi</b>(Links) face&#355;i clic pe <b>Leg&#259;turi</b> (Hyperlinks)</li>
                <li>&#351;i &#238;n fereastra care apare selecta&#355;i <b>Fișier sau pagin&#259; Web care exist&#259;</b>(Existing File or Web Page),<br><img src="imagini/link_4_15.png"> </li>
                <li>În caseta <b>C&#259;utare în</b>(Look in), faceți clic pe <b>Folder current</b>(Current Folder), &#351;i c&#259;utați fișierul la care doriți s&#259; creați linkul și selectați-l.</li>
                <li>Click pe OK &#351;i se creeaz&#259; link-ul.<br><img src="imagini/link_4_16.png"></li>
            </ul>
            <li class="titlu" id="f4_6">6. Crearea unui hyperlink la o locație din alt document.</li>
            <ul>
                <li>Selectați textul sau imaginea care doriți s&#259; se afișeze ca hyperlink,</li>
                <li>&#206;n fila <b>Inserare</b> (Insert) &#238;n grupul  <b>Leg&#259;turi</b>(Links) face&#355;i clic pe <b>Leg&#259;turi</b> (Hyperlinks)</li>
                <li>&#351;i &#238;n fereastra care apare selecta&#355;i <b>Fișier sau pagin&#259; Web care exist&#259;</b>(Existing File or Web Page), </li>
                <li>În caseta <b>C&#259;utare în</b>(Look in), faceți clic pe <b>Folder current</b>(Current Folder), &#351;i c&#259;utați fișierul la care doriți s&#259; creați linkul și selectați-l.</li>
                <li>Click pe <b>Marcaje</b>(Bookmarks) &#351;i se selecta&#355;i o loca&#355;ie din documentul selectat.<br><img src="imagini/link_4_17.png"></li>
                <li>Click pe OK &#351;i se creeaz&#259; link-ul.<br><img src="imagini/link_4_18.png"></li>
            </ul>
            
            <li class="titlu" id="f4_7">7. Inserarea casetelor de text &#238;n document.</li>
            <p>
                Casetele de text v&#259; ofer&#259; controlul asupra poziției unui bloc de text în document. Puteți plasa casetele de text oriunde în document și le puteți formata cu umbre și margini. Conținutul casetei de text poate fi formatat ca orice alt text din document. Puteți aplica formatarea de caractere și paragrafe și puteți utiliza stiluri folosind instrumentele din fila <b>Format</b>.              
            </p>
            <ul>
                <li>&#206;n fila <b>Inserare</b> (Insert) &#238;n grupul  <b>Text</b>(Text) face&#355;i clic pe <b>Caseta text</b> (Text Box)<br><img src="imagini/caseta_text_4_19.png"></li>
                <li>&#351;i &#238;n fereastra care apare selecta&#355;i o caset&#259; de text predefinit&#259; sau desena&#355;i una nou&#259;,<br><img src="imagini/caseta_text_4_20.png"> </li>
                <li>Caseta text apare cu o margine subțire și v&#259; ofer&#259; "mânere" de utilizat pentru redimensionarea sau repoziționarea casetei de text.<br><img src="imagini/caseta_text_4_21.png"></li>
            </ul>
            
            <li class="titlu" id="f4_8">8. Ad&#259;ugarea unui desen &#238;n document.</li>
            <p>
                Pe fila <b>Inserare</b> (Insert) &#238;n grupul <b> Ilustrații</b>(Illustrations) faceți clic pe <b>Forme</b>(Shapes):  <br><img src="imagini/desene_4_22.png"><br>&#351;i  din list&#259; se poate alege forma dorit&#259;:<br><img src="imagini/desene_4_23.png"><br>Fila <b>Format</b> apare dup&#259; ce inserați o form&#259; desenat&#259;. 
            </p>

            <li class="titlu" id="f4_9">9.  APLICA&#354;IE:</li>
                <ol style="list-style: a"> 
                    <li> Lansa&#355;i procesorul de text Microsoft Word</li>
                    <li>Pentru margini alege&#355;i formatarea predefinit&#259; <b>Normal</b> din list&#259;</li>
                    <li>Insera&#355;i antetul &#351;i subsolul care au fost  salva&#355;i &#238;n galerie la Fișa 1;
                    <li> Scrie&#355;i titlul &#354;&#258;RI DIN EUROPA cu font <B>Courier New</B>, m&#259;rime <b>18</b>, culoare <b>ro&#351;ie</b>(red), subliniat cu linie dubl&#259;, centrat </li>
                    <li>Din pagina <a href="https://ro.wikipedia.org/wiki/Austria">Austria</a> copia&#355;i &#238;n prima pagin&#259; primele patru paragrafe. Indenta&#355;i prima linie din fiecare paragraf. Insera&#355;i note de subsol la nivel de pagin&#259; (Footnote) pentru cuvintele <i>constitu&#355;ie</i> &#351;i <i>democra&#355;ie</i>. Alinia&#355;i paragrafele la stânga, text de culoare verde, Arial,  m&#259;rimea 14.</li>
                    <li>Din pagina <a href="https://ro.wikipedia.org/wiki/Fran%C8%9Ba">Fran&#355;a</a> copia&#355;i &#238;n a doua pagin&#259; primele patru paragrafe. Insera&#355;i note de subsol la nivel de pagin&#259; (Footnote) pentru cuvintele <i>catolici</i> &#351;i <i>protestanți</i>. Alinia&#355;i paragrafele la centru, text de culoare albastr&#259;, Verdana,  m&#259;rimea 12.</li> 
                    <li>Din pagina <a href="https://ro.wikipedia.org/wiki/Spania">Spania</a> copia&#355;i &#238;n a treia pagin&#259; primele patru paragrafe. Insera&#355;i note de subsol la nivel de pagin&#259; (Footnote) pentru cuvintele <i>migrație</i> &#351;i <i>colonizare</i>. Alinia&#355;i paragrafele la dreapta, text de culoare ro&#351;ie, Times New Roman,  m&#259;rimea 16.</li>
                    <li>Insera&#355;i note de subsol la nivel de document(Endnote) pentru textul <i>climă temperată </i> &#351;i <i>Cordoba</i></li>
                    <li>Insera&#355;i o imagine de fundal(Watermark) cu steagul Uniunii europene.</li>
                    <li>Insera&#355;i marcaje la primul cuv&#226;nt de pe fiecare pagin&#259;.</li>
                    <li>Vizualiza&#355;i marcajele.</li>
                    <li>La sf&#226;r&#351;itul documentului insera&#355;i c&#226;te o leg&#259;tur&#259; la fiecare marcaj.</li>
                    <li>Insera&#355;i un chenar de pagin&#259; la alegere.</li>
                    <li>Insera&#355;i numere de pagin&#259;.</li>
                    <li>Salva&#355;i documentul cu numele &#39;TARI EUROPENE.docx&#39;.</li>
                    <li>Crea&#355;i un nou document Word cu numele &#39;UNIUNEA EUROPEANA.docx&#39; &#238;n care copia&#355;i &#238;n prima pagin&#259; primele trei paragrafe despre <a href="https://ro.wikipedia.org/wiki/Uniunea_European%C4%83">Uniunea European&#259;</a>. Alinierea textului s&#259; fie justify,tipul fontului Bradley Hand ITC, marimea 20. Indenta&#355;i prima linie din fiecare paragraf. </li>
                    <li>Insera&#355;i o imagine de fundal(Watermark) cu steagul Uniunii europene.</li>
                    <li>Insera&#355;i un chenar de pagin&#259; la alegere.</li>
                    <li>Insera&#355;i la sf&#226;r&#351;itul documentului urm&#259;toarea caset&#259; de text(Austin Quote):<br><img src="imagini/caseta_text_4_24.png">. <br> Roti&#355;i caseta de text cu 45 grade &#238;n sens invers trigonometric.</li>
                    <li>Insera&#355;i la sf&#226;r&#351;itul documentului urm&#259;torul desen:<br><img src="imagini/desen_4_25.png"><br>  Ata&#351;a&#355;i acestei imagini o leg&#259;tur&#259; la al doilea marcaj din documentul &#39;TARI EUROPENE.docx&#39;.</li>
                    <li>Insera&#355;i numere de pagin&#259;.</li>
                    <li>Salva&#355;i documentul.</li>
                </ol>
        </ol>
    </body>
</html>