<!DOCTYPE html>
<html>
    <head>
        <title>Fisa Excel 1</title>
        <style>
        .titlu {
            padding: 8px;
            margin: 25px;

            /* other styling */
            background-color: #33475b;
            border-radius: 10px;
            color: white;
            font-family: colibri;
            font-size: 20px;
        }
        </style>
    </head>
    <body>    
        <h4>Documente Excel</h4>
        <h1 style="text-align: center;"><u>Fi&#351;a Nr.1</u></h1>
        <h2 style="text-align: center;"><u>Formatarea paginii</u></h2>
        <p>
           <b> Microsoft Excel</b> este un program de calcul tabelar.Actuala versiune disponibil&#259; este Microsoft Excel 365 — pentru Windows — &#351;i Microsoft Excel 2016 — pentru Mac OS.<br> Celula reprezintă componenta fundamentală a unei foi de calcul în Excel.O celulă în Excel este alcătuită din mai multe componente importante, cum ar fi:
            <ul>
                <li>Adresa celulei: reprezintă identificatorul unic al unei celule și este format din litera corespunzătoare coloanei și numărul rândului.</li>
                <li>Conținutul celulei: poate fi un număr, text, o formulă sau o funcție.</li>
                <li>Formatul celulei: determină modul în care conținutul este afișat, cum ar fi formatul valutar, formatul dată sau formatul text.</li>
                <li>Stilurile celulei: includ proprietăți cum ar fi fontul, culoarea de fundal, alinierea și bordurile.</li>
                <li>Valorile celulelor dependente: dacă o celulă conține o formulă, aceasta poate folosi valorile celulelor dependente pentru a calcula rezultatul.</li>
            </ul>
        </p>
        <p class="titlu" id="f1_1"><b>1. Deschiderea aplica&#355;iei Microsoft Excel</b></p> 
		      Start → Programs → Microsoft Office → Microsoft Excel<br> 
		      sau dublu clic pe pictograma <img src="img/shortcut_1.png"> de pe desktop.
        <p class="titlu" id="f1_2"><b>2. &#206;nchiderea aplica&#355;iei</b></p>
		              <b>Fi&#351;ier(File) → Ie&#351;ire(Close)</b> sau clic pe butonul X din fereastra deschis&#259; (dreapta sus)
        <p class="titlu" id="f1_3"><b>3. Crearea unui document nou pornind de la un &#351;ablon gol</b></p> 
			         Clic pe <u>File</u> → clic pe <u>New</u>  → clic <img src="img/blank_1.png"><br>
        <p class="titlu" id="f1_4"><b>4. Modificarea sau setarea marginilor de pagin&#259;</b></p>
            &#206;n fila <b>Aspect pagin&#259; </b>(Page Layout)<img src="img/margini_1.png"> face&#355;i clic pe <b>Margini </b>(Margins) &#351;i din list&#259; pute&#355;i alege un<br>
            tip de margine (Normal, Wide, etc) sau <b>Margini particularizate… </b>(custom Margins…
        <p class="titlu" id="f1_5"><b>5. Modificarea sau setarea orient&#259;rii &#238;ntregului document.</b></p> &#206;n fila <b>Aspect pagin&#259; </b>(Page Layout) <img src="img/orientare_1.png">→ Clic pe Orientare(Orientation) → Alegem Portret(Portrait) sau Vedere(Landscape)
        <p class="titlu" id="f1_6"><b>6. Setarea m&#259;rimi documentului</b></p> 
            &#206;n fila <b>Aspect pagin&#259; </b>(Page Layout)<img src="img/marime_1.png"> → M&#259;rime(Size) → Se alege o m&#259;rime din list&#259; sau More Paper Sizes..
        <p class="titlu" id="f1_7"><b>7. M&#259;rirea sau mic&#351;orarea rapid&#259; a unui document</b></p>
		Pe bara de stare g&#259;si&#355;i glisorul Panoramare. Glisa&#355;i la setarea procentual&#259; dorit&#259;<img src="img/glisare_1.png">
        <p class="titlu" id="f1_8"><b>8. Inserarea aceluia&#351;i antet &#351;i a aceluia&#351;i subsol &#238;ntr-un document</b></p>
	    &#206;n fila <b>Aspect pagin&#259; </b>(Page Layout)<br> &#238;n grupul Setare Pagin&#259;(Page Setup)  → Click pe s&#259;geata dreapta jos, apare Page Setup<br><img src="img/page_setup.png"><br>
	     → Click pe Antet/Subsol(Header/Footer)<br> <img src="img/header_footer_1.png"> 
		<br> → Click pe proiectul de antet sau subsol dorit .
        <p class="titlu" id="f1_9"><b>9. Inserarea textelor sau reprezent&#259;rilor grafice &#238;ntr-un antet sau subsol &#351;i salvarea acestora &#238;n galerie</b></p>
		&#206;n fila <b>Aspect pagin&#259; </b>(Page Layout)<br> &#238;n grupul Setare Pagin&#259;(Page Setup)  → Click pe s&#259;geata dreapta jos, apare Page Setup<br>
	     → Click pe Antet/Subsol(Header/Footer) → Click pe Antet Personalizat(Custom Header) <br><img src="img/header_footer_2.png"><br>→ Insera&#355;i textul sau reprezentarea grafic&#259; &#238;n
	        sec&#355;iunile din st&#226;nga, centru &#351;i dreapta.<br> Formatarea imaginilor se poate face: <br>
		<img src="img/format_picture.png"><br>
	    	Pentru a pune &#238;n aplicare noile set&#259;ri, apas&#259; butonul OK.
        <p class="titlu" id="f1_10"><b>10. Redenumirea unei foi de lucru</b></p>
            <ol style="list-style-type: lower-latin;font-size: 18px;">
                <li>&#206;n bara Selectori foi, face&#355;i clic cu butonul din dreapta pe selectorul foii pe care dori&#355;i s&#259; o redenumi&#355;i, apoi clic pe Redenumire(Rename)<br><img src="img/redenumire_foaie.png">; </li>
                <li>Selecta&#355;i numele curent, apoi tasta&#355;i numele nou.</li>
            </ol>
        <p class="titlu" id="f1_11"><b>11. Introducerea numerelor sau a textului &#238;n celule.</b></p>
            <ol style="list-style-type: lower-latin;font-size: 18px;">
                <li>&#206;n foaia de lucru, face&#355;i clic pe o celul&#259; ; </li> 
                <li>Tasta&#355;i numerele sau textul dorit, apoi tasta&#355;i ENTER sau TAB.<br>
                    Pentru a introduce date &#238;n aceia&#351;i celul&#259; dar pe un r&#226;nd nou se apas&#259; ALT+ENTER.
                </li>
            </ol>
        <p class="titlu" id="f1_12"><b>12. Modificarea l&#259;&#355;imii coloanei &#351;i  &#238;n&#259;l&#355;imii liniei.</b></p>
            <ol style="list-style-type: lower-latin;font-size: 18px;">
                <li>Selecta&#355;i celula → Pagina de pornire (Home) → grupul Celule (Cells) → Clic pe Formatare(Format) → Dimensiune celul&#259; (Cell Size) → op&#355;iunea L&#259;&#355;ime coloan&#259; (Column Width..) d&#259; posibilitatea introducerii valorii de la tastatur&#259;, iar op&#355;iunea Autofit Column Width potrive&#351;te automat l&#259;&#355;imea coloanei la lungimea con&#355;inutului:<br>
                  <br><img src="img/latime_col.png">  
                </li> 
                <li>La fel se procedeaz&#259; &#351;i pentru &#206;n&#259;l&#355;imea liniei(Row Height) .
                </li>
            </ol>
        <p class="titlu" id="f1_13"><b>13. Introducerea simultan&#259; a acelora&#351;i date &#238;n celule diferite.</b></p>
            <ol style="list-style-type: lower-latin;font-size: 18px;">
                <li>Dac&#259; celulele sunt al&#259;turate:<br>Se selectează prima celul&#259; → Se introduc datele dorite &#238;n celul&#259; → Se pozi&#355;ioneaz&#259; pointerul 
                    mouse-ului &#238;n col&#355;ul dreapta jos p&#226;n&#259; c&#226;nd pointerul se transform&#259; &#238;ntr-o cruce neagr&#259; +<br><img src="img/tragere_1.png"> → se apas&#259; butonul st&#226;ng &#351;i cu el &#355;inut ap&#259;sat se umple &#351;i celelalte celule:<br>
                  <br><img src="img/tragere_2.png">  
                </li> 
                <li>Dac&#259; celulele nu sunt al&#259;turate(pe s&#259;rite):<br>Se selecteaz&#259; pe r&#226;nd celulele dorite (&#355;in&#226;nd ap&#259;sat&#259; tasta CTRL) → Se tasteaz&#259; valoarea dorit&#259; &#238;n ultima celula activ&#259; → CTRL + Enter &#351;i valoarea tastat&#259; apare &#238;n toate celulele selectate:
                    <br><img src="img/tragere_3.png">
                </li>
            </ol>
        <p class="titlu" id="f1_14"><b>14. APLICA&#354;IE:</b></p>
            <ol style="list-style-type: lower-latin;font-size: 20px;">
                <li>Lansa&#355;i aplica&#355;ia <b>Microsoft Office Excel</b>;</li>
                <li>S&#259; se creeze documentul <b>clasa10</b> pornind de la un &#351;ablon gol;</li>
                <li>S&#259; se schimbe orientarea paginii la Vedere(Landscape);</li>
                <li>Scrie&#355;i &#238;n prima celul&#259; num&#259;rul 13579 s&#259; copia&#355;i acest num&#259;r &#238;n toate coloanele de la A la M pe primele 34 de linii;</li>
                <li>Scrie&#355;i &#238;n zig-zag, de la linia 35 p&#226;n&#259; la linia 104, num&#259;rul 24680, ca &#238;n modelul de mai jos:<br>
                  <img src="img/zig_zag.png">  
                </li>
                <li>S&#259; se modifice marginile paginilor folosind setarea implicit&#259; <b>Narrow</b>;</li>
                <li>S&#259; se modifice m&#259;rimea paginilor la A4;</li>
                <li>S&#259; se modifice l&#259;&#355;imea coloanelor la 10 &#351;i &#238;n&#259;l&#355;imea liniilor la 20;</li>
                <li>S&#259; se insereze un antet care s&#259; con&#355;in&#259; textul "LICEUL NATIONAL DE INFORMATICA" &#238;n sec&#355;iunea din st&#226;nga, numele &#351;i prenumele &#238;n sec&#355;iunea din centru &#351;i sigla liceului &#238;n sec&#355;iunea din dreapta. Imaginea s&#259; aib&#259; 2,5 cm &#238;n&#259;l&#355;ime;</li>
                <li>S&#259; se insereze un subsol care s&#259; con&#355;in&#259; &#238;n sec&#355;iunea din st&#226;nga num&#259;rul de pagin&#259;, &#238;n sec&#355;iunea din centru data &#351;i &#238;n sec&#355;iunea din dreapta ora realiz&#259;rii documentului;</li>        
                <li>Salva&#355;i documentul realizat.</li>
            </ol>
    </body>
</html>
