<html>
    <head>
         <title>Arhitectura internetului</title>
         <style>
            table,td{
                border: 1px solid;
                border-collapse: collapse;
            }
             h1{
                 text-align: center;
             }
         </style>
    </head>
    <body>
        <h1>Fi&#351;a nr. 23</h1>  
        <ol>
            <li>Deschide&#355;i aplica&#355;ia de calcul tabelar. &#206;ntr-un nou registru, redenumi&#355;i prima foaie de calcul – 
                "Manuale &#351;colare". </li>
            <li>Aplica&#355;i urm&#259;toarele set&#259;ri de pagin&#259;: orientarea h&#226;rtiei – tip vedere; dimensiunea h&#226;rtiei – A4 ; 
                marginile: sus – 1,5 cm, jos – 1,5 cm, st&#226;nga – 2,5 cm, dreapta – 2 cm.</li>  
            <li>Introduce&#355;i &#238;n antet, aliniat la dreapta data &#351;i ora curent&#259;.</li>  
            <li>&#206;n domeniul de celule C2:G2 scrie&#355;i textul „LIBRĂRIA ART – Stocul de manuale &#351;colare”. 
                Formata&#355;i textul cu fontul Monotype Corsiva, dimendiunea 17, culoare ro&#351;ie.</li>
            <li>Introduce&#355;i, &#238;ncep&#226;nd din celula B3, urm&#259;toarele date: <br> <br>
                <table>
                    <tr>
                        <td>Nr. crt</td> <td>Titlul manualului</td> <td>Clasa</td> <td>Pre&#355;</td> <td>Buc&#259;&#355;i</td> <td>Pre&#355; total</td> <td>Num&#259;r manuale vandute</td> <td> Stoc</td>
                    <tr> 
                        <td>1</td> <td>Matematic&#259;</td> <td>a IX-a</td> <td>18.5</td> <td>100</td> <td> </td> <td>100</td> <td> </td>
                    </tr>
                    <tr>
                        <td>2</td> <td>Fizic&#259;</td> <td>a X-a</td> <td>20</td> <td>200</td> <td> </td> <td>50</td> <td> </td>
                    </tr>
                    <tr>
                        <td>3</td> <td>Chimie</td> <td>a IX-a</td> <td>11</td> <td>300</td> <td> </td> <td>20</td> <td> </td>
                    </tr>
                    <tr>
                        <td>4</td> <td>Biologie</td> <td>a X-a</td> <td>12,3</td> <td>50</td> <td> </td> <td>10</td> <td> </td>
                    </tr>
                    <tr>
                        <td>5</td> <td>Informatic&#259;</td> <td>a X-a</td> <td>15.7</td> <td>20</td> <td> </td> <td>20</td> <td> </td>
                    </tr>
                </table> <br>
                Aplica&#355;i tabelului un contur exterior cu linii duble de culoare verde &#351;i linii interioare punctate de culoare neagr&#259;. 
            </li> <br>
            <li>Folosind formule &#351;i func&#355;ii completa&#355;i coloanele r&#259;mase libere astfel: 
                <ul>
                <li> Pre&#355; total = Pre&#355;*Buc&#259;&#355;i </li>
                <li>Stoc: <br> -Stoc epuizat, dac&#259; (Buc&#259;&#355;i - Num&#259;r manuale vandute) = 0 <br>
                       -&#206;n stoc, dac&#259; (Buc&#259;&#355;i - Num&#259;r manuale v&#226;ndute) > 0 </li>
                </ul>
            </li>
            <li>Calcula&#355;i un total al tuturor manualelor (al buc&#259;&#355;ilor) &#351;i scrie&#355;i rezultatul &#238;n celula G10 </li> <br>
            <li>Sorta&#355;i datele din tabel dup&#259; coloana Pre&#355;, ascendent.</li> <br>
            <li>Copia&#355;i datele din coloanele "Nr.crt", "Titlul manualului" &#351;i "Stoc", &#238;n a doua foaie de calcul, &#238;ncep&#226;nd cu celula C5.</li>
            <li>Pe baza datelor din coloanele "Titlul manualului" &#351;i "Pre&#355;" crea&#355;i o diagram&#259; de tip coloan&#259;. Stabili&#355;i titlurile: <br>
                - pentru diagram&#259; “Total manuale pe discipline”. Titlul va fi scris cu fontul Arial, dimensiunea 14, culoarea albastr&#259;. <br>
                - axa X – Manuale &#351;colare; <br>
                - axa Y – Pre&#355;; <br>
                Legenda s&#259; fie scris&#259; &#238;n partea de jos a diagramei. Amplasa&#355;i diagrama &#238;ntr-o foaie nou&#259; cu numele “Grafic_manuale”. <br> <br></li>
                <li>Salva&#355;i fi&#351;ierul cu numele vostru sub forma Nume_Prenume.xls (xlsx)</li>
        </ol> 
      
    </body>
</html>