<!DOCTYPE html>
<html>
 <head>
    <title>Fi&#351;a de lucru excel</title>
     <style>
         h1{
             text-align: center;
         }
         table,td{
             border: 1px solid black;
             border-collapse: collapse;
         }
     </style>
  </head>
 <body>
 <h1>Fi&#351;a nr. 26</h1>
 <ol>
 <li> Deschide&#355;i aplica&#355;ia de calcul tabelar. &#206;ntr-un nou registru, redenumi&#355;i prima foaie de calcul -
Medicamente.</li>
<li> Aplica&#355;i urm&#259;toarele set&#259;ri de pagin&#259;: orientarea h&#226;rtiei – tip vedere; dimensiunea h&#226;rtiei – A4;
marginile: sus – 2 cm, jos – 2 cm, stânga – 2,5 cm, dreapta – 2,5 cm.</li>
 <li>Introduce&#355;i, &#238;ncep&#226;nd din celula A3, urm&#259;toarele date (a se respecta forma celulelor A3:H3):</li>
     <table>
         <tr><td>Nr. crt.</td><td>Denumire</td><td>Pre&#355; unitar</td><td>Pre&#355; cu TVA</td><td>Nr buc&#259;&#355;i</td><td>Form&#259; prezentare</td><td>Valoare total&#259;</td><td>Obs</td>
         </tr>
         <tr><td>1</td><td>Aspirin&#259;</td><td></td><td></td><td></td><td>Cps</td><td></td><td></td>
         </tr>
         <tr><td>2</td><td>Nurofen</td><td></td><td></td><td></td><td>Cps</td><td></td><td></td>
         </tr>
         <tr><td>3</td><td>Aspacardin</td><td></td><td></td><td></td><td>Cps</td><td></td><td></td>
         </tr>
         <tr><td>4</td><td>Bephanten</td><td></td><td></td><td></td><td>unguent</td><td></td><td></td>
         </tr>
         <tr><td>5</td><td>Calciu efervescent</td><td></td><td></td><td></td><td>Cps</td><td></td><td></td>
         </tr>
         <tr><td>6</td><td>Lecitin&#259;</td><td></td><td></td><td></td><td>granule</td><td></td><td></td>
         </tr>
         <tr><td></td><td>TOTAL</td><td></td><td></td><td></td><td></td><td></td><td></td>
         </tr>
         <tr><td></td><td>Minim</td><td></td><td></td><td></td><td></td><td></td><td></td>
         </tr>
         <tr><td></td><td>Maxim</td><td></td><td></td><td></td><td></td><td></td><td></td>
         </tr>
         <tr><td></td><td>Nr. med. CPS</td><td></td><td></td><td></td><td></td><td></td><td></td>
         </tr>
     </table>
 <li> Completa&#355;i tabelul dup&#259; urm&#259;toarele criterii:
-Celulele C4:C9 vor avea un criteriu de validare a datelor, neput&#226;nd fi introduse valori mai mari sau egale cu 100. In cazul &#238;nc&#259;lc&#259;rii regulii s&#259; apar&#259; mesajul de oprire ”valoare>100”<br>
-TVA este 24%<br>
-Valoarea total&#259; este valoarea ob&#355;inut&#259; din &#238;nmul&#355;irea pre&#355;ului cu TVA și nr. Bucă&#355;i.</li>
<li> Introduce&#355;i o formul&#259; &#238;n celula C11 pentru a calcula suma grupului de celule C4 : C9. Copia&#355;i formula din celula C11 &#226;n celulele D11, E11 și G11 </li>
<li> Introduc&#355;ei o formul&#259; &#238;n celula C13 pentru a calcula valoarea minim&#259; a grupului de celule C4: C9. Copia&#355;i formula din celula C13 &#238;n celulele D13, E13 și G13.</li>
<li> Formata&#355;i celulele din grupul B4:F7 astfel &#238;nc&#226;t s&#259; prezinte simbolul monetar lei.</li>
<li> Completa&#355;i celulele H4:H9 astfel: dac&#259; pre&#355;ul este <50 cu “autohton”, contrar cu “import”.</li>
<li> Realiza&#355;i un grafic de tip coloan&#259; pe baza datelor din celulele B3:C6. Graficul va avea denumirea
Vânz&#259;ri, pe fiecare coloan&#259; fiind afi&#351;at&#259; valoarea. Muta&#355;i graficul sub linia 20 a foii de lucru.</li>

<li> Introduce&#355;i o formul&#259; &#238;n celula C14 pentru a calcula valoarea minim&#259; a grupului de celule C4 : C9.
Copia&#355;i formula din celula C14 &#238;n celulele D14, E14 și G14.</li>
<li> &#206;n celula C15 introduce&#355;i o formul&#259; care num&#259;r&#259; c&#226;te medicamente au forma de prezentare capsule</li>

<li> Salva&#355;i registrul cu numele vostru "Nume_Prenume_26.xlsx" </li>
</ol>
   </body>
</html>