<!DOCTYPE html>
<html>
    <head>
        <title>Fi&#351;a excel 3</title>

        <style>
            .titlu {
                padding: 8px;
                margin: 25px;

                /* other styling */
                background-color: #33475b;
                border-radius: 10px;
                color: white;
                font-family: colibri;
                font-size: 20px;
            }
        </style>
    </head>
    <body>
        <PageTitle style="text-align:center">
            <h1>
                <u>
                    F I &#350; A Nr. 3 <br>
                    Introducerea formulelor şi funcţiilor
                </u>
            </h1>
        </PageTitle><br>
            <p>
                <b> Microsoft Excel</b> este un program de calcul tabelar.Actuala versiune disponibil&#259; este Microsoft Excel 365 — pentru Windows — &#351;i Microsoft Excel 2016 — pentru Mac OS.<br> Celula reprezint&#259; componenta fundamental&#259; a unei foi de calcul &#238;n Excel.O celul&#259; &#238;n Excel este alc&#259;tuit&#259; din mai multe componente importante, cum ar fi:
            </p>
            <ul>
                <li>Adresa celulei: reprezint&#259; identificatorul unic al unei celule &#351;i este format din litera corespunz&#259;toare coloanei &#351;i num&#259;rul rândului.</li>
                <li>Con&#355;inutul celulei: poate fi un num&#259;r, text, o formul&#259; sau o func&#355;ie.</li>
                <li>Formatul celulei: determin&#259; modul &#238;n care con&#355;inutul este afi&#351;at, cum ar fi formatul valutar, formatul dat&#259; sau formatul text.</li>
                <li>Stilurile celulei: includ propriet&#259;&#355;i cum ar fi fontul, culoarea de fundal, alinierea &#351;i bordurile.</li>
                <li>Valorile celulelor dependente: dac&#259; o celul&#259; con&#355;ine o formul&#259;, aceasta poate folosi valorile celulelor dependente pentru a calcula rezultatul.</li>
            </ul>
            <p class="titlu" id="f3_1"><b>1. Sortarea datelor dintr-o coloan&#259;.</b></p>
                <ol type="a">
                    <li>Selecta&#355;i coloana ce dori&#355;i s&#259; o sorta&#355;i</li>
                    <li>În fila Pagin&#259; de pornire(Home), &#238;n grupul Editare(Editing), face&#355;i clic pe Sortare & Filtrare (Sort & Filter).</li>
                    <li>Se alege <b><i>Sort A to Z</i></b> dac&#259; se dore&#351;te sortarea cresc&#259;toare sau <b><i>Sort Z to A</i></b> dac&#259; se dore&#351;te sortarea descresc&#259;toare</li><img src="img3/4.png" alt="Sortarea datelor dintr-o coloan&#259;">
                </ol>
            <p class="titlu" id="f3_2"><b>2. Introducerea formulelor.</b></p>
                <ol type="a">
                    <li>Daţi clic pe celula în care vreţi sa introduceţi formula.</li>
                    <li>Tastaţi semnul = , tastaţi formula, şi apăsaţi tasta Enter.</li>
                    <li><b><i>Exemplu:</i></b> Dacă introducem in celula <b>C1</b> formula =<b>A1-B1</b> , după apăsarea tastei Enter în celula C1 va fi afişat rezultatul <b>9</b> ca diferenţă intre numărul 23 din celula A1 şi numărul 14 din celula B1, adică 23-14=9</li>
                </ol>
                <img src="img/4.1.png">
             <p class="titlu" id="f3_3"><b>3. Introducerea formulelor din libr&#259;ria de func&#355;ii.</b></p>
                <ol type="a">
                    <li>Daţi clic pe celula în care vreţi sa introduceţi formula.</li>
                    <li>In fila Formule (Formulas), &#238;n grupul Librarie formule(Function Library) daţi clic pe AutoSum, alegeţi o formulă din listă, stabiliţi argumentele funcţiei (Function Arguments) şi daţi OK.<br><img src="img/4.3.png"></li>
                    <li><b><i>Exemplu:</i></b> Dacă introducem in celula E2 funcţia AVERAGE (media) si alegem ca argument al funcţiei intervalul (A2:D2) , în celula E2 va fi afişată media notelor de la A2 la D2.<br><img src="img/4.3_1.png"> <br><img src="img/4.3_2.png"></li>
                </ol>
            <p class="titlu" id="f3_4"><b>4. Copierea unei funcţii sau formule.</b></p>  
                <p>Se selectează celula care conţine funcţia (formula) → Se poziţionează pointerul mouse-ului în colţul dreapta jos al celulei până când pointerul se transformă într-o cruce neagră +→ se apasă butonul stâng şi cu el ţinut apăsat ne deplasăm pe rândul de celule unde dorim să copiem funcţia (formula). </p>
        
            <p class="titlu" id="f3_5"><b>5. APLICA&#354;IE:</b>
            <ol type="a">
                <li>Descarca&#355;i fi&#351;a de lucru <a href="fisa_excel_functii.xlsx" rel="noopener" target="_blank"> funcții în excel</a></li>
                <li>Realiza&#355;i un tabel cu orarul clasei</li>
                <li>Modifica&#355;i l&#259;&#355;imea coloanelor pentru a se potrivi cu con&#355;inutul</li>
                <li>Seta&#355;i &#238;n&#259;l&#355;imea r&#226;ndurilor de m&#259;rime 25 </li>
                <li>Ad&#259;uga&#355;i o coloan&#259; &#238;n fa&#355;a primei coloane &#238;n care scrie&#355;i intervalul orar</li>
                <li> Salva&#355;i registrul realizat</li>
                <li>Sorta&#355;i datele din coloane ascendent &#351;i descendent</li>
                <li>Formata&#355;i textul folosind diferite tipuri &#351;i m&#259;rimi de font, diferite efecte (<b>bold</b>, <i>italic</i>, <u>underline</u>), diferite culori pentru fundal şi font. </li>
                <li>Bordura&#355;i tabelul &#351;i salva&#355;i fi&#351;ierul pe parti&#355;ia C cu numele ORAR</li>
            </ol>

    </body>
</html>