<!DOCTYPE html>
<html>
    <head>
        <title>Fi&#351;a excel 4</title>

        <style>
            body {
                font-size:20px;
                margin-left: 20px;
                margin-right: 20px;
            }

            table {
                margin-left:auto;
                margin-right:auto;
                width: 95%;
            }
            .titlu {
                padding: 8px;
                margin: 25px;

                /* other styling */
                background-color: #33475b;
                border-radius: 10px;
                color: white;
                font-family: colibri;
                font-size: 20px;
            }
        </style>

    </head>
    <body>
        <PageTitle style="text-align:center">
            <h1>
                <u>
                    F I &#350; A Nr. 4 <br>
                    Inserarea WordArt, formelor &#351;i diagramelor.
                </u>
            </h1>
        </PageTitle><br>
            <p class="titlu" id="f4_1"><b>1. Ad&#259;ugarea unui text WordArt.</b></p>
                <ol type="a">
                    <li>În fila Inserare (Insert), în grupul Leg&#259;turi(Links), faceţi clic pe Text  →  WordArt apoi faceţi clic pe stilul dorit:<br><img src="img/word_art.png"> </li>
                    <li>Introduceţi textul dorit, poziţionaţi &#351;i dimensionaţi blocul WordArt.</li>
                    <li>Pentru a ad&#259;uga format&#259;ri, selectaţi fila Formatare(Format):<br><img src="img/word_art_format.png"></li>
                </ol> 
        
            <p class="titlu" id="f4_2"><b>2. Ad&#259;ugarea unei forme(shapes).</b></p>
                <ol type="a">
                    <li>În fila Inserare (Insert), în grupul Ilustraţii (Illustration), faceţi clic pe Shapes apoi faceţi clic pe forma dorit&#259; din list&#259; &#351;i daţi OK:<br><img src="img/shapes.png"> </li>
                    <li>Selectaţi forma, în fila Formatare (Format) daţi clic pe Umplere form&#259; (Shape Fill), selectaţi din list&#259; Imagine (Picture…), clic pe imaginea dorit&#259; &#351;i daţi clic pe butonul Insert<br><img src="img/shapes_1.png"> </li>
            </ol>
            <p class="titlu" id="f4_3"><b>3. Crearea diagramelor în Excel.</b></p>
                <ol type="a">
                    <li>Selectaţi tabelul sau porţiunea de tabel pentru care vreţi s&#259; realizaţi o diagram&#259;</li>
                    <li>În fila Inserare (Insert), în grupul Diagrame (Charts), faceţi clic pe grupul de diagrame dorit (Column, Line, Pie, Area, Scatter sau Other Chart) &#351;i din lista afi&#351;at&#259; alegem tipul de diagram&#259; dorit. </li>
                    <li>Sau click în dreapta jos în grupul Diagrame (Charts) (cerculeţul ro&#351;u):<br><img src="img/diagrame_1.png"><br> Se alege tipul de diagrama dorit:
                    <br><img src="img/diagrame_2.png"><br> Click pe OK :<br><img src="img/diagrame_3.png"><br></li>
                    <li>Pentru a ad&#259;uga format&#259;ri, selectaţi fila Formatare(Format) &#351;i folosind uneltele din aceast&#259; fil&#259; aveţi posibilitatea s&#259;:
                        <ul>
                            <li>Umpleţi elementele diagramei: utilizaţi culori, texturi, imagini &#351;i degrade-uri de umplere pentru a atrage atenţia asupra anumitor elemente din diagram&#259;. </li>
                            <li>Modificaţi conturul elementelor diagramei: utilizaţi culori, stiluri de linii &#351;i grosimi de linie pentru a accentua elemente din diagram&#259;.</li>
                            <li>Ad&#259;ugaţi efecte speciale la elementele diagramei: aplicaţi efecte speciale, cum ar fi cele de umbr&#259;, reflexie, str&#259;lucire, muchii atenuate, te&#351;itur&#259; &#351;i rotaţii 3-D pentru formele elementelor diagramei, care ofer&#259; acesteia un aspect finisat. </li>
                            <li>Formataţi textul &#351;i numerele: aveţi posibilitatea s&#259; formataţi textul &#351;i numerele în titluri, etichete &#351;i casete text într-o diagram&#259; a&#351;a cum aţi face cu text &#351;i numere într-o foaie de lucru. Pentru a face ca textul &#351;i numerele s&#259; ias&#259; în evidenţ&#259;, aveţi posibilitatea s&#259; aplicaţi &#351;i stiluri WordArt.<br><img src="img/formatare.png"> </li>
                        </ul>
                    </li>
                </ol>
               
            <br>
            <p class="titlu" id="f4_4"><b>4. APLICA&#354;IE:</b>
            <ol type="a">
                <li>Lansa&#355;i aplica&#355;ia <b><i>Microsoft Office Excel; </i></b></li>
                <li>Realiza&#355;i un tabel cu orarul clasei;</li>
                <li>Modifica&#355;i l&#259;&#355;imea coloanelor la 40;</li>
                <li>Seta&#355;i &#238;n&#259;l&#355;imea r&#226;ndurilor de m&#259;rime 25 </li>
                <li>Ad&#259;uga&#355;i o coloan&#259; &#238;n fa&#355;a primei coloane &#238;n care scrie&#355;i intervalul orar;</li>
                <li>Formata&#355;i textul folosind diferite tipuri &#351;i m&#259;rimi de font, diferite efecte (<b>bold</b>, <i>italic</i>, <u>underline</u>), diferite culori pentru fundal &#351;i font &#238;n primele trei coloane; </li>
                <li>Bordura&#355;i tabelul &#351;i redenumi&#355;i foaia de calcul cu numele ORAR</li>
                <li>Ad&#259;uga&#355;i o nou&#259; foaie de calcul cu numele CHELTUIELI; </li>
                <li>Editaţi tabelul de calcul de mai jos:</li>
                <img src="img/4.4.png">
                <li>În celula <b>E4</b> va fi scris&#259; formula <red>=D4-C4</red>;</li>
                <li>Formula din <b>E4</b> va fi translatat&#259; (copiat&#259;) &#351;i pentru celulele <b>E5</b> &#351;i <b>E6</b>;</li>
                <li>În celula <b>G4</b> va fi scris&#259; formula <red>=E4*F4</red>;</li>
                <li>Formula din <b>G4</b> va fi translatat&#259; (copiat&#259;) &#351;i pentru celulele <b>G5 – G8</b>;</li>
                <li>În celula <b>G9</b> va fi aplicat&#259; funcţia <red>SUM</red>;</li>
                <li>Ad&#259;ugaţi acestui tabel un titlu scris în WordArt; </li>
                <li>Creaţi o diagram&#259; folosind datele din coloanele "UTILITATI", "P/U" &#351;i "VALOARE";</li>
                <li>Formataţi diagrama pentru a obţine un aspect pl&#259;cut;</li>
                <li>Ad&#259;ugaţi o form&#259; SmartArt pe care o umpleti cu o imagine;</li>
                <li>Salvaţi fi&#351;ierul cu numele REGISTRU CHELTUIELI.</li>
            </ol>

    </body>
</html>