<!DOCTYPE html>
<html lang="en">
    <head>
        <title>Tabele</title>
        <style>
            .titlu {
                padding: 8px;
                margin: 25px;

                /* other styling */
                background-color: #33475b;
                border-radius: 10px;
                color: white;
                font-family: colibri;
                font-size: 20pt;
            }
        </style>

        <meta charset="utf-8"> 
        
    </head>
    <body>
        <PageTitle style="text-align:center">
            <u>
                <h1>F I &#350;  A  Nr. 5</h1>
                <h2> Inserarea tabelelor &#238;n documente Word.</h2>
            </u>
        </PageTitle><br>

        <ol type="1">
            <li class="titlu"  id="f5_1">1. Metode de inserare a tabelelor.</li>
            <ol type="a">
                <li>Utilizarea &#351;abloanelor pentru tabele</li>
                <p>Face&#355;i clic unde dori&#355;i s&#259; insera&#355;i un tabel</p>
                <p>
                    Pe fila <b>Inserare</b> (Insert), &#238;n grupul <b>Tabele</b> (Tables), faceşi clic pe 
                    <b>Tabel</b> (Table),alege&#355;i <b>Tabele rapide</b> (Quick Tables) apoi face&#355;i 
                    clic pe &#351;ablonul dorit.<br><img src="imagini/tabel_5_1.png"><br><img src="imagini/tabel_5_2.png">
                </p>
                <li>Utilizarea comenzii inserare tabel</li>
                <p>Face&#355;i clic unde dori&#355;i s&#259; insera&#355;i un tabel</p>
                <p>
                    Pe fila <b>Inserare</b> (Insert), &#238;n grupul <b>Tabele </b>(Tables), faceşi clic pe <b>Tabel</b> (Table),alege&#355;i <b>Inserare tabel</b> (Insert Table...) <br><img src="imagini/tabel_5_3.png"><br>apoi in eticheta deschis&#259; introduce&#355;i num&#259;rul de coloane (columns) &#351;i num&#259;rul de linii (rows) dorit<br><img src="imagini/tabel_5_4.png">
                </p>
                <li>Utilizarea comenzii desenare tabel</li>
                <p>Face&#355;i clic unde dori&#355;i s&#259; insera&#355;i un tabel</p>
                <p>
                    Pe fila <b>Inserare</b> (Insert), &#238;n grupul <b>Tabele </b>(Tables), faceşi clic pe <b>Tabel</b> (Table),alege&#355;i <b>Desenare tabel</b> (Draw Table) <br><img src="imagini/tabel_5_5.png">
                </p>
                <li>Utilizarea comenzii foaie de calcul Excel</li>
                <p>Face&#355;i clic unde dori&#355;i s&#259; insera&#355;i un tabel</p>
                <p>
                    Pe fila <b>Inserare</b> (Insert), &#238;n grupul <b>Tabele </b>(Tables), faceşi clic pe <b>Tabel</b> (Table),alege&#355;i <b>Foaie de calcul Excel</b> (Excel Spreadsheet) <br><img src="imagini/tabel_5_6.png"><br><img src="imagini/tabel_5_7.png">
                </p>
            </ol>

            <li class="titlu"  id="f5_2">2. &#206;mbinare celule</li>
            <p>
                Selecta&#355;i celulele pe care dori&#355;i s&#259; le imbina&#355;i<br><img src="imagini/tabel_5_8.png"> <br>
                Sub <b>Instrumente tabel</b>(Table Tools) pe fila <b>Aspect</b> (Layout) &#238;n grupul de <b>&#206;mbinare</b>(Merge) da&#355;i clic pe <b>&#206;mbinare celule</b> 
                (Merge cells). <br><img src="imagini/tabel_5_9.png">
            </p>

            <li class="titlu" id="f5_3">3. Scindare celule.</li>
            <p>
                Selecta&#355;i celula sau celulele pe care dori&#355;i s&#259; le scinda&#355;i (diviza&#355;i) <br>
                Sub <b>Instrumente tabel</b>(Table Tools) pe fila <b>Aspect</b> (Layout) &#238;n grupul de <b>&#206;mbinare</b>(Merge) da&#355;i clic pe <b>Scindare celule</b> 
                (Split cells).<br><img src="imagini/tabel_5_10.png">
            </p>
            
            <li class="titlu" id="f5_4">4. Inserarea  de linii &#351;i coloane.</li>
            <p>
                Sub <b>Instrumente tabel</b>(Table Tools) pe fila <b>Aspect</b> (Layout) &#238;n grupul de <b>Linii &amp; coloane</b>(Rows &amp; Columns) da&#355;i clic pe <b>Inserare stânga</b> (Insert Left) sau <b>Inserare dreapta</b>(Insert Right), <b>Inserare deasupra</b>(Insert Above) sau <b>Inserare sub</b>(Insert Bellow), faţă de poziţia cursorului în tabel:<br><img src="imagini/tabel_5_11.png">
            </p>
            <li class="titlu" id="f5_5">5. &#350;tergerea de celule, linii &#351;i coloane.</li>
            <p>
                Sub <b>Instrumente tabel</b>(Table Tools) pe fila <b>Aspect</b> (Layout) &#238;n grupul <b>Linii &amp; coloane</b>(Rows &amp; Columns) da&#355;i clic pe <b>&#350;tergere</b> (Delete):<br><img src="imagini/tabel_5_12.png"><br>Se poate şterge tabelul, liniile, coloanele şi celulele selectate.
            </p>
            
            <li class="titlu" id="f5_6">6. Transformarea unui text selectat în tabel şi invers.</li>
            <ol type="a">
                <li>Selecta&#355;i textul pe care dori&#355;i s&#259;-l transforma&#355;i → pe fila <b>Inserare</b> (Insert) → grupul <b>Tabele</b> (Tables) → clic pe <b>Convertire text în tabel</b> (Convert Text to Table)<br>
                <img src="imagini/tabel_5_13.png"><br>apoi in eticheta deschis&#259; introduce&#355;i num&#259;rul de coloane (columns) &#351;i num&#259;rul de linii (rows) dorit &#351;i delimitatorul folosit &#238;ntre cuvinte:<br><img src="imagini/tabel_5_14.png">
                </li>
                <li>Selecta&#355;i tabelul pe care dori&#355;i s&#259;-l transforma&#355;i. Sub <b>Instrumente tabel</b>(Table Tools) pe fila <b>Aspect</b> (Layout) &#238;n grupul <b>Date</b>(Data) da&#355;i clic pe <b>Conversie la text</b> (Convert to Text):<br><img src="imagini/tabel_5_15.png"><br>apoi in eticheta deschis&#259; stabili&#355;i delimitatorul care va fi folosit &#238;ntre cuvinte:<br><img src="imagini/tabel_5_16.png">
                </li>
            </ol>
            <li class="titlu" id="f5_7">7. Sortarea datelor &#238;n tabele.</li>
            <p>
                Se pot sorta pe coloane datele din tabel, crescător sau descrescător, după maxim trei coloane.<br>Selecta&#355;i tabelul pe care dori&#355;i s&#259;-l sorta&#355;i. Sub <b>Instrumente tabel</b>(Table Tools) pe fila <b>Aspect</b> (Layout) &#238;n grupul <b>Date</b>(Data) da&#355;i clic pe <b>Sortare</b> (Sort):<br><img src="imagini/tabel_5_17.png"><br>apoi in eticheta deschis&#259; stabili&#355;i numele coloanei după care se face sortarea, modul de sortare: crescător sau descrescător(Ascending,  Descending) &#351;i dacă tabelul are sau nu linie antet(Header row)<br><img src="imagini/tabel_5_18.png"><br>Tabelul sortat este:<br><img src="imagini/tabel_5_19.png">          
            </p>
            
            <li class="titlu" id="f5_8">8. Efectuarea unor calcule în tabele.</li>
            <p>
                Se poziţionează cursorul în ultima celulă necompletată pe un rând sau coloană.Sub <b>Instrumente tabel</b>(Table Tools) pe fila <b>Aspect</b> (Layout) &#238;n grupul <b>Date</b>(Data) da&#355;i clic pe <b>Formula</b> (Formula):<br><img src="imagini/tabel_5_20.png"><br>  În caseta <b>Formula</b>, este afişată automat funcţia =SUM(left) pentru adunarea elementelor de pe linie, sau =SUM(above) pentru adunarea elementelor de pe coloană. Dacă dorim altă funcţie, o alegem din caseta Paste Function şi o introducem în caseta Formula.<br><img src="imagini/tabel_5_22.png"><br>Dacă selectăm func&#355;ia Medie aritmatică(AVERAGE(ABOVE))<br><img src="imagini/tabel_5_21.png"><br> atunci va calcula media pe coloana Nota:<br><img src="imagini/tabel_5_23.png">
            </p>
            
            <li class="titlu" id="f5_9">9. Setarea chenarelor(bordurilor) la celule sau tabele.</li>
            <p>
                Selecta&#355;i tabelul sau celula la care dori&#355;i s&#259; seta&#355;i un chenar. Sub <b>Instrumente tabel</b>(Table Tools) pe fila <b>Proiectare</b> (Design) &#238;n grupul <b>Borduri</b>(Borders) se pot alege stilul(Border Style), culoarea(Pen Color), grosimea (1/2pt) &#351;i pozi&#355;ia bordurii<br><img src="imagini/tabel_5_24.png"><br>
            </p>
            
            <li class="titlu" id="f5_10">10. Stabilirea proprietăţilor unui tabel.</li>
            <p>
                Sub <b>Instrumente tabel</b>(Table Tools) pe fila <b>Aspect</b> (Layout) &#238;n grupul <b>Tabel</b>(Table) da&#355;i clic pe <b>Proprietăţi</b> (Properties):<br><img src="imagini/tabel_5_25.png"><br>În caseta <b>Proprieta&#355;i  tabel</b>(Table Properties)<br><img src="imagini/tabel_5_26.png"><br> se pot seta proprietăţile pentru:
                <ul>
                    <li>Tabel(Table): dimensiunile(Size), alinierea şi indentarea (Alignment) şi modul de aranjare a textului în jurul tabelului(Text Wrapping), borduri şi umbrire(Borders and Shading)
                    </li>
                    <li>Linie(Row): dimensiunea(Size) liniilor (înălţimea) şi Op&#355;iuni(Options): posibilitatea de a împărţi un rând de tabel pe două pagini(Allow row to break across pages) şi posibilitatea ca o linie să fie antet în fiecare pagină unde este tabelul(Repeat as header row at the top of each page) . Dacă nu este selectată opţiunea Allow row to break across pages tabelul se redimensionează automat astfel încât rândul să încapă în pagină.
                    </li>
                    <li>Coloană(Column): dimensiunea(Size) coloanelor (lăţimea) şi unitatea de masură
                    </li>
                    <li>Celule(Cells): dimensiunea(Size) celulelor, alinierea pe verticală textului în celulă(Vertical alignment). Se mai pot seta op&#355;iuni(Options) din caseta Op&#355;iuni celula(Cell Options).<br><img src="imagini/tabel_5_27.png"></li>
                </ul>
            </p>
            <li class="titlu" id="f5_11">11.  APLICA&#354;IE:</li>
                <ol style="list-style: a"> 
                    <li> Lansa&#355;i procesorul de text Microsoft Word</li>
                    <li>Pentru margini alege&#355;i formatarea predefinit&#259; <b>Moderate</b> din list&#259;</li>
                    <li>Insera&#355;i antetul &#351;i subsolul care au fost  salva&#355;i &#238;n galerie la Fisa 1;
                    <li> Scrie&#355;i titlul ECUA&#354;IA DE GRADUL AL DOILEA cu font <B>CASTELLAR</B>, m&#259;rime <b>18</b>, culoare <b>ro&#351;ie</b>(red), subliniat cu linie punctat&#259;, centrat </li>
                    <li>Scrie&#355;i folmula de calcul a r&#259;d&#259;cinilor ecua&#355;iei de gradul doi</li>
                    <li>Sub ecua&#355;ie scrie&#355;i textul: PROGRAM DE VACAN&#354;&#258; cu font <B>ALGERIAN</B>, m&#259;rime <b>18</b>, culoare <b>albastr&#259;</b>(blue), aliniat la dreapta.</li>                
                    <li>Sub acest text insera&#355;i o imagine de vacan&#355;&#259; &#351;i ad&#259;uga&#355;i acesteia o bordur&#259; de tip linie &#238;ntrerupt&#259; de culoare verde de grosime 6 pt &#351;i efect de tip Umbrire(Shadow).</li>
                    <li>&#206;n urm&#259;toarea pagin&#259; insera&#355;i imaginea &#351;i textul urm&#259;tor cu caractere Courier New  m&#259;rimea 12.<br><img src="imagini/turing.png"></li>
                    <li>Insera&#355;i o imagine Clip Art la alegere.</li>
                    <li>&#206;n urm&#259;toarea pagin&#259; realiza&#355;i organigrama de mai jos:<br><img src="imagini/fisa6_1.png">.</li>
                    <li>Insera&#355;i o imagine de fundal(Watermark) la alegere.</li>
                    <li>Insera&#355;i un chenar la pagin&#259; la alegere.</li>
                    <li>Insera&#355;i numere de pagin&#259;.</li>
                </ol>
        </ol>
    </body>
</html>
