<html>
   
    <head>
        <style>
            h1{
                text-align: center;
            }
        </style>
    </head>
    <body>
        <h1>Fi&#351;a nr.9 </h1>
        <ol> 
        <li>Porni&#355;i aplica&#355;ia pentru prezent&#259;ri, deschide&#355;i o nou&#259; prezentare &#351;i insera&#355;i &icirc;n aceasta zece noi diapozitive. </li>
            <li>Primul diapozitiv va fi de tip titlu &#351;i va con&#355;ine titlul <i>&#8222;Cursuri de formare&rdquo;</i> &#351;i subtitlul &#8222;2022- 2023&rdquo;.  </li>
        <li> Al doilea diapozitiv va fi de tip titlu &#351;i text. Titlul <i>&ndash; &#8222;Comunicare&rdquo;</i> va fi scris cu font Papyrus, culoare albastr&#259;, dimensiune 50. Textul va con&#355;ine: 
         <p><i>-Tehnici de comunicare &#351;i negociere</i> </p> 
         <p><i>-Teoria comunic&#259;rii</i></p>
         <p><i>-Comunicare &#351;i rela&#355;ii publice</i></p>     
       Aplica&#355;i un efect de anima&#355;ie titlului &#351;i marcatori, la alegere, cursurilor de mai sus</li>
     <li> &Icirc;n diapozitivul trei insera&#355;i un tabel ce con&#355;ine num&#259;rul de cursan&#355;i care au solicitat &icirc;nscriere pentru fiecare dintre cele trei cursuri.</li>
     <li>Folosind datele din diapozitivul precedent, ad&#259;uga&#355;i &icirc;n diapozitivul patru o diagram&#259; de tip &ldquo;linie&rdquo;. Modifica&#355;i culoarea graficului &icirc;n verde.</li>
     <li>Diapozitivul cinci va con&#355;ine o imagine potrivit&#259; cu titlul din diapozitivul 1. Aplica&#355;i o linie de contur de culoare verde, grosime 6 pct &#351;i un efect de anima&#355;ie de intrare.</li>
     <li>&Icirc;n diapozitivul &#351;ase insera&#355;i dou&#259; butoane de ac&#355;iune. Primul face trecerea c&#259;tre diapozitivul 1, iar cel de-al doilea c&#259;tre ultimul diapozitiv.</li>
    <li>Insera&#355;i &icirc;n diapozitivul 10, folosind scrierea artistic&#259;, textul &#8222;Spor la lucru!&rdquo;.</li>
     <li>&Icirc;n diapozitivul &#351;apte insera&#355;i o ilustra&#355;ie SmartArt dup&#259; modelul celei de mai jos.</li>
        <img src="fisa9_2.png"/>
     <li> &Icirc;n diapozitivele 8 &#351;i 9 insera&#355;i formele</li>
     <img src="fisa9_1.png"/>
    <li>Ad&#259;uga&#355;i &icirc;ntregii prezent&#259;ri ca design template un &#351;ablon ales de dvs. &#351;i aplica&#355;i un efect de tranzi&#355;ie &icirc;ntregii prezent&#259;ri. Salva&#355;i fi&#351;ierul cu numele Oferta de cursuri. </li>
     </ol>
    </body>
</html>
          