<html>
    <head> 
        <title> Fis&#259; nr.15</title>
        <style>
            table,td,th{
                border: 1px solid black;
                border-collapse: collapse;
            }
            th{
                background-color: aqua;
            }
            td{
                background-color: lightgray;
            }
        </style>
    </head>
    <body> 
        <h1> Fis&#259; nr.15</h1>
        <ol>
        <li>Porni&#355;i aplica&#355;ia pentru prezent&#259;ri, deschide&#355;i o nou&#259; prezentare.</li>
        <li>Primul diapozitiv va fi de tip titlu &#351;i va con&#355;ine titlul „Cafea” &#351;i subtitlul „Istoria cafelei”. </li>
        <li>Ad&#259;uga&#355;i un al doilea diapozitiv care va fi de tip titlu &#351;i text. Titlul – „Tipuri de cafea”. Textul va con&#355;ine:</li>
        <i>Arabica</i><br>
        <i>Robusta</i><br>
        <i>Liberica </i><br>
        <i>Maragogype </i><br>
           Aplica&#355;i un efect de anima&#355;ie, la alegere, titlului &#351;i pentru fiecare din tipurile de cafea. 
        <li>Ad&#259;uga&#355;i un nou diapozitiv &#238;n care insera&#355;i un tabelul cu primii 5 produc&#259;tori de cafea ai lumii. </li>
            <table>
                <tr>
                    <th>&#354;ar&#259;</th><th>Tone cafea</th>
                </tr>
                <tr>
                    <td>Brazilia</td><td>2179270 </td>
                </tr>
                <tr> 
                    <td>Vietnam</td><td>990000</td>
                </tr>
                <tr>
                    <td>Indonezia</td><td>762006</td>
                </tr>
                <tr>
                    <td>Columbia</td><td>682580</td>
                </tr>
                <tr>
                    <td>Mexic</td><td>310861</td>
                </tr>
            </table>
            <li>Folosind datele din diapozitivul precedent, ad&#259;uga&#355;i &#238;n urm&#259;torul diapozitiv o diagram&#259; de tip coloan&#259;, pe fiecare din acestea fiind afi&#351;ate valorile.</li>
            <li>&#238;n urm&#259;torul diapozitiv de tipul ”Titlul &#351;i dou&#259; con&#355;inuturi” introduce&#355;i la titlul ”Efectele cafelei” iar &#238;n cele dou&#259; zone pentru con&#355;inuturi ”Efecte pozitive” &#351;i ”Efecte negative” ale cafelei. </li>
            <li>Insera&#355;i un nou diapozitiv care s&#259; cuprind&#259; cuprinsul prezent&#259;rii. Muta&#355;i diapozitivul pe pozi&#355;ia 2 &#238;n prezentare.</li>
            <li>Insera&#355;i o singur&#259; dat&#259;, folosind o func&#355;ie special&#259;, &#238;n col&#355;ul din dreapta jos imaginea urm&#259;toare astfel &#238;nc&#226;t aceasta s&#259; apar&#259; pe fiecare diapozitiv:</li>
            <img src="fisa15.png">
            <li>Insera&#355;i butoane de ac&#355;iune &#238;n prezentare astfel. Pe primul diapozitiv un buton de trecere c&#259;tre urm&#259;torul, pe diapozitivele 2-5 dou&#259; butoane, unul de trecere c&#259;tre urm&#259;torul, cel&#259;lalt de trecere c&#259;tre anteriorul. Ultimul diapozitiv are un singur buton de trecere c&#259;tre anteriorul. </li>
            <li>Ad&#259;uga&#355;i &#238;ntregii prezent&#259;ri ca design template un &#351;ablon ales de voi &#351;i aplica&#355;i un efect de tranzi&#355;ie &#238;ntregii prezent&#259;ri. Salva&#355;i fi&#351;ierul cu numele vostru "nume_prenume.pptx"</li>
            
        </ol>
    </body>
</html>