<html> 
<head> 
<title> Fi&#351;a nr. 14 </title>
    <style>
         h1{
             text-align: center;
         }
        table,td{
            border: 1px solid black;
            border-collapse: collapse;
            
        }
        table{
            width: 30%;
            margin-left: 15%;
        }
    </style>
</head>
<body>
<h1>Fi&#351;a nr. 14 </h1>
<ol> 
<li> Porni&#355;i aplica&#355;ia pentru prezent&#259;ri, deschide&#355;i o nou&#259; prezentare &#351;i insera&#355;i &#238;n aceasta &#351;ase noi diapozitive</li>
<li>Primul diapozitiv va fi de tip titlu &#351;i va con&#355;ine titlul &bdquo;<i>Excursii</i>&rdquo; &#351;i subtitlul &bdquo;<i>Ofert&#259; 2023</i>&rdquo;.</li>
<li> Al doilea diapozitiv va fi de tip titlu &#351;i text. Titlul – &bdquo;<i>Ofert&#259; destina&#355;ii turistice</i>&rdquo; va fi scris cu fontul Comic Sans MS, culoare verde, dimensiune 40. Textul va fi scris cu marcatori &#351;i va con&#355;ine:<br> 
<i>Destina&#355;ii turistice &#238;n Rom&#226;nia</i><br> 
<i>Destina&#355;ii turistice &#238;n str&#259;in&#259;tate</i><br> 
Aplica&#355;i un efect de anima&#355;ie de intrare titlului, astfel &#238;nc&#226;t acesta s&#259; apar&#259; din dreapta.</li>
<li>Ad&#259;ugați &#238;n diapozitivul doi o not&#259; de subsol cu textul &bdquo;<i>Diapozitiv oferte&rdquo;</i>. </li>
<li>&#206;n diapozitivul trei insera&#355;i urm&#259;torul tabel:  </li>
<table>
    <tr><td><b>DESTINA&#354;II</b></td>  <td><b>PRE&#354;</b></td> </tr>
    <tr><td>Paris</td> <td>400</td> </tr>
    <tr><td>Londra</td> <td>300</td></tr>
    <tr><td>Brasov</td> <td>100</td></tr>
</table>
    <li>Folosind datele din tabel, insera&#355;i o diagram&#259; de tip &bdquo;linie&rdquo;. Modifica&#355;i culoarea de fundal a graficului &#238;n galben.</li>
    <li>Diapozitivul patru va con&#355;ine o imagine cu Marea Neagr&#259;. Transforma&#355;i imaginea &#238;ntr-o imagine de tip Basic Shapes – Sun. Roti&#355;i imaginea cu un efect 3D pe axa y cu 30<sup>o</sup> .</li>
    <li>&#206;n diapozitivul cinci insera&#355;i o ilustra&#355;ie SmartArt după modelul celei de mai jos. </li><img src="fisa14.png"><br>
    <a href="https://edu.gcfglobal.org/en/powerpoint2016/smartart-graphics/1/">PowerPoint 2016 - SmartArt Graphics</a>
   
    <li>&#206;n diapozitivul &#351;ase insera&#355;i un buton de ac&#355;iune ce va face leg&#259;tura cu primul diapozitiv și o form&#259; predefinit&#259; de tip s&#259;geat&#259; ce va face leg&#259;tura cu al treilea diapozitiv.</li>
    <li> Ad&#259;uga&#355;i &#238;ntregii prezent&#259;ri ca design template un &#351;ablon ales de dvs. &#351;i aplica&#355;i un efect de tranzi&#355;ie &#238;ntregii prezent&#259;ri. Salva&#355;i fi&#351;ierul cu numele &bdquo;<i>Oferta de excursii</i>&rdquo;.</li>
    
</ol>

</body>

</html>