<html>
    <head>
        <style>
            h1,td{
                text-align: center;
            }
            table,td{
                border: 1px solid black;
                border-collapse: collapse;
                
            }
        </style>
    </head>
    <body>
        <h1>Fi&#351;a nr.6</h1>
        <p>Pentru a adăuga aceeași imagine la toate diapozitivele din PowerPoint, puteți adăuga imaginea la coordonatorul de diapozitive. Iată pașii    pentru a face acest lucru:</p>
            <ul>
                <li>Deschideți prezentarea PowerPoint,</li>
                <li>Faceți clic pe fila Vizualizare (View):<br><img src="view_6_1.png"></li>
                <li>Faceți clic pe Coordonator Diapozitive (Slide Master):<br><img src="master1_6_2.png"><br><img src="master2_6_3.png"></li>
                <li>Faceți clic pe butonul Inserare imagine și selectați imaginea pe care doriți să o adăugați:<br><img src="inser_img1_6_4.png">
                    <br><img src="inser_img2_6_5.png"><br><img src="inser_img3_6_6.png">
                </li>
                <li>Redimensionați și poziționați imaginea:<br><img src="inser_img4_6_7.png"></li>
                <li>Faceți clic pe butonul Închidere vizualizare master pentru a ieși din coordonatorul de diapozitive:<br><img src="close_6_8.png"></li>
            </ul>
        <p>Imaginea va apărea acum pe toate diapozitivele din prezentare. Dacă doriți să eliminați imaginea dintr-un anumit diapozitiv, o puteți șterge pur și simplu din diapozitivul respectiv:<br><img src="rezultat_6_9.png"></p>
        <br>
        <b>APLICAŢIE</b>
        <ol>
            <li>Porni&#355;i aplica&#355;ia pentru prezent&#259;ri, deschide&#355;i o nou&#259; prezentare.</li>
            <li>Primul diapozitiv va fi de tip titlu &#351;i va con&#355;ine titlul <i>„C&#259;l&#259;torul</i>” &#351;i subtitlul <i>„Firm&#259; de            transport intern &#351;i extern”</i>.</li>
            <li>Ad&#259;uga&#355;i un al doilea diapozitiv care va fi de tip titlu &#351;i text. Titlul – „Trasee”. Textul va con&#355;ine:<br>
                <i>Suceava-Roma</i><br>
                <i>Suceava- Madrid</i><br>
                <i>Suceava-Paris</i><br>
                <i>Suceava-Londra</i><br>
                Aplica&#355;i un efect de anima&#355;ie titlului &#351;i marcatori, la alegere, pentru fiecare din trasee. </li>
            <li>Ad&#259;uga&#355;i un nou diapozitiv <i>”Pre&#355;uri”</i> &#238;n care insera&#355;i un tabel cu pre&#355;ul dus-&#238;ntors al c&#259;l&#259;toriilor:
<table>
    <tr><td>Ruta</td> <td>Adul&#355;i</td>  <td>Copii</td> <td>Pensionari</td></tr>
<tr><td>Suceava-Roma</td>  <td>90€</td> <td>30€ <td>45€</td>
<tr><td>Suceava-Madrid</td> <td>150€</td> <td>50€</td> <td>75€</td>
<tr><td>Suceava-Paris</td> <td>130€</td> <td>40€</td> <td>65€</td>
<tr><td>Suceava-Londra</td> <td>180€</td> <td>60€</td> <td>90€ </td>
                </table> 
            </li>
            <li>Folosind datele din diapozitivul precedent, ad&#259;ugaţi &#238;n urm&#259;torul diapozitiv o diagram&#259; de tip
coloan&#259;, pe fiecare din acestea fiind afi&#351;ate valorile.</li>
            <li>&#206;n urm&#259;torul diapozitiv <i>”Organigrama”</i> realiza&#355;i organigrama firmei de transport</li>
            <img src="fisa6_1.png">
            <li>Insera&#355;i un nou diapozitiv <i>”Cuprins”</i> care s&#259; con&#355;in&#259; cuprinsul prezent&#259;rii. Muta&#355;i diapozitivul pe
pozi&#355;ia 2 &#238;n prezentare.</li>
            <li>Insera&#355;i o singur&#259; dat&#259;, folosind o func&#355;ie special&#259;, &#238;n col&#355;ul din dreapta jos imaginea urm&#259;toare
astfel &#238;nc&#226;t aceasta s&#259; apar&#259; pe fiecare diapozitiv:</li>
            <img src="fisa6_2.png">
        <li>Ad&#259;uga&#355;i &#238;ntregii prezent&#259;ri o tem&#259; aleas&#259; de voi &#351;i aplica&#355;i un efect de tranzi&#355;ie
&#238;ntregii prezent&#259;ri. Salva&#355;i fi&#351;ierul cu numele vostru "Nume_Prenume.pptx".
</li>
        </ol>
    </body>
</html>