<html>
    <head>
        <title>Pensiune</title>
        <style>
            h1,td{
                text-align: center;
            }
            table,td{
                border: 1px solid black;
                border-collapse: collapse;
                
            }
        </style>
    </head>
    <body>
        <h1>Fi&#351;a nr.7</h1>
        <b>APLICAŢIE</b>
        <ol>
            <li>Porni&#355;i aplica&#355;ia pentru prezent&#259;ri, deschide&#355;i o nou&#259; prezentare.</li>
            <li>Primul diapozitiv va fi de tip titlu &#351;i va con&#355;ine titlul <i>„Pensiunea Bistri&#355;a</i>” &#351;i subtitlul <i>„Prezentarea pensiunii și a împrejurimilor”</i>.</li>
            <li>Ad&#259;uga&#355;i un al doilea diapozitiv care va fi de tip titlu &#351;i text. Titlul – „Facilita&#355;i”. Textul va con&#355;ine:<br>
                <b>General</b><br>
                    recepţie deschisă nonstop, terasă, camere pentru nefumători, lift, check-in/check-out express, seif,
                    încălzire, cameră de bagaje, restaurant (à la carte)<br>
                <b>Activităţi</b><br>
                    saună, masaj, tenis de masă, cadă cu hidromasaj, drumeţii<br>
                Aplica&#355;i un efect de anima&#355;ie titlului &#351;i marcatori, la alegere, pentru fiecare facilitate. </li>
            <li>Ad&#259;uga&#355;i un nou diapozitiv <i>”Pre&#355;uri”</i> &#238;n care insera&#355;i un tabel cu pre&#355;urile practicate:
                <table>
                    <tr><td></td> <td>Condi&#355;ii</td>  <td>Maxim</td> <td>Pre&#355; (RON)</td></tr>
                    <tr><td>Cameră dublă</td>  <td>Mic dejun inclus</td> <td>2 pers. <td>225</td>
                    <tr><td>Suită</td> <td>Mic dejun inclus</td> <td>2 pers.</td> <td>335</td>
                    <tr><td>Suită superioară</td> <td>Mic dejun inclus</td> <td>2 pers.</td> <td>405</td>
                </table>  
            </li>
            <li>Adăugați un nou diapozitiv ”Profit” în care vor fi introduse sumele încasate în ultimii 3 ani:
                <table>
                    <tr><td>An</td> <td>2010 (mii lei)</td>  <td>2011 (mii lei)</td> <td>2012 (mii lei)</td></tr>
                    <tr><td>Profit</td>  <td> 230.25</td> <td>280.47 <td> 340.01</td>
                </table>
            </li>
            <li>Folosind datele din diapozitivul precedent, ad&#259;ugaţi &#238;n urm&#259;torul diapozitiv o diagram&#259; radial&#259;, având           afi&#351;ate valorile pe grafic. <br>Pentru detalii:
                <a href="https://support.microsoft.com/ro-ro/office/ad%C4%83ugarea-unei-diagrame-radiale-1a5f08ae-ba40-46f2-9ed0-ff84873b7863">Diagrame radiale</a><br><img src="diagrama_7_1.png">
            </li>
            <li>&#206;n urm&#259;torul diapozitiv <i>”Organigrama”</i> realiza&#355;i organigrama pensiunii.<br>Pentru detalii:
                <a href="https://support.microsoft.com/ro-ro/office/crearea-unei-organigrame-%C3%AEn-office-utiliz%C3%A2nd-smartart-9b51f667-11b7-4971-a757-a08a36684ee6">Organigrame</a><br><img src="organigrama_7_2.png">
            </li>
            <li>Insera&#355;i un nou diapozitiv <i>”Cuprins”</i> care s&#259; con&#355;in&#259; cuprinsul prezent&#259;rii. Muta&#355;i diapozitivul pe pozi&#355;ia 2 &#238;n prezentare.</li>
            <li>Insera&#355;i o singur&#259; dat&#259;, folosind o func&#355;ie special&#259;, &#238;n col&#355;ul din dreapta jos imaginea urm&#259;toare astfel &#238;nc&#226;t aceasta s&#259; apar&#259; pe fiecare diapozitiv:</li>
            <img src="pensiune_7_3.png">
            <li>În primul diapozitiv realizați pentru titlul prezentării ”Pensiunea Bistrița” un hyperlink către pagina de internet a acesteia:             https://pensiuneabistritaeforiesud.cazare7.ro</li>
            <li>Ad&#259;uga&#355;i &#238;ntregii prezent&#259;ri o tem&#259; aleas&#259; de voi &#351;i aplica&#355;i un efect de tranzi&#355;ie
                &#238;ntregii prezent&#259;ri. Salva&#355;i fi&#351;ierul cu numele vostru "Nume_Prenume.pptx".
            </li>
        </ol>
    </body>
</html>