<html>
    <head>
        <title> Angajatori</title>
        <style>
            h1{
                text-align: center;
            }
            table,td{
                border: 1px solid black;
                border-collapse: collapse;
            }
        </style>
    </head>
    <body>
        <h1>Fi&#351;a nr.8</h1>
        <h2>Formatare imagini</h2>
        <p>Puteți aplica o bordură proprie pentru o imagine astfel:<br>Pentru detalii: 
            <a href="https://support.microsoft.com/ro-ro/office/ad%C4%83ugarea-unei-borduri-sau-a-unui-alt-stil-la-o-imagine-18d3b5b3-9a26-4bb5-9d69-8b83110261d9">Ad&#259;ugare borduri.</a></p>
        <ul>
            <li>Selectați imaginea de pe diapozitiv,</li>
            <li>Pe fila Format , selectați Bordură imagine(Picture Border).<br>Meniul vă oferă opțiuni pentru Culoare,Grosime ( grosime linie) și stil linie, inclusiv linii solide și întrerupte.<br><img src="fisa_8_1.png">
            </li>
        </ul>
        <b>APLICAŢIE</b>
        <ol>
            <li>Porni&#355;i aplica&#355;ia pentru prezent&#259;ri &#351;i deschide&#355;i o nou&#259; prezentare</li>
            <li> Prima folie trebuie s&#259; fie de tip Titlu, s&#259; con&#355;in&#259; textul „Angajatori de top”, scris cu font Comic Sans MS, culoare ro&#351;ie, dimensiune 30.</li>
            <li> Ad&#259;uga&#355;i explica&#355;ia „Valabil pentru anul 2023” &#238;ntr-un dreptunghi rotunjit. Pentru dreptunghi, seta&#355;i culoarea verde, &#238;n nuan&#355;e diferite, pentru umplere linie.</li>
            <li> Ad&#259;uga&#355;i a doua folie. Pentru aspectul diapozitivului selecta&#355;i Titlu &#351;i text. Titlul, Companii na&#355;ionale, va fi cu font Comic Sans MS, culoare ro&#351;ie, dimensiune 30, cu efect de umbr&#259;. Sec&#355;iunea text con&#355;ine:</li>
            <ul>
                <li> CFR Marf&#259;</li>
                <li> CFR C&#259;l&#259;tori</li>
                <li> Hidroelectrica</li>
                <li> Po&#351;ta Română</li>
            </ul>
            <li>Pentru text folosi&#355;i formatul implicit.</li>
            <li> A treia folie s&#259; aib&#259; formatul “Titlu &#351;i tabel”. Titlul -„Studiu comparativ” va fi scris cu font Courier New, culoare ro&#351;ie, dimensiune 30. Insera&#355;i tabelul:</li>    
             <table>
                <tr><td>Anul</td><td>CFR C&#259;l&#259;tori </td><td>CFR Marf&#259;</td><td>Hidroelectica</td><td>Po&#351;ta Român&#259;</td></tr>
                <tr><td>2020 </td><td>300</td><td>50 </td><td>200 </td><td>100</td></tr>
                <tr><td>2021</td><td>250 </td><td>50</td><td>150 </td><td>100</td></tr>
            </table>
            <li>Ad&#259;uga&#355;i explica&#355;ia „mii angaja&#355;i”, &#238;n oval, de culoare verde.</li>
            <li> Folia a patra a prezent&#259;rii trebuie s&#259; con&#355;in&#259; urm&#259;torul text „C&#259;l&#259;tori&#355;i ieftin &#351;i &#238;n siguran&#355;&#259;!” cu font Comic Sans MS, culoare ro&#351;ie, dimensiune 30, aliniat centrat.</li>
            <li> Ad&#259;uga&#355;i acestei folii imaginea de mai jos. Imaginea va avea chenar violet de tip Punct Linie, grosime 2 pct.</li>
                 <img src="fisa8.png">
            <li> Folia cinci va conţine o diagram&#259; de tip linie, pe baza datelor din folia trei.</li>
            <li> Ad&#259;uga&#355;i &#238;n ultimul diapozitiv un buton de ac&#355;iune care s&#259; permit&#259; saltul la primul diapozitiv.</li>
            <li>Aplica&#355;i, pentru toate diapozitivele, efectul de tranzi&#355;ie &#351;tergere &#238;n jos &#351;i ad&#259;uga&#355;i                  prezent&#259;rii o tem&#259; aleas&#259; de voi. Salva&#355;i fi&#351;ierul cu numele vostru "Nume_Prenume.pptx".
            </li>   
        </ol>
    </body>