<html>
    <head>
        <title>Fi&#351;a nr. 13</title>
        <style>
            h1{
                text-align: center;
            }
        </style>
    </head>
    <body>
        <h1> Fi&#351;a nr. 13</h1>
   <ol>
    
    <li> Porni&#355;i aplica&#355;ia pentru prezent&#259;ri, deschide&#355;i o nou&#259; prezentare &#351;i insera&#355;i în aceasta nou&#259; noi
diapozitive.
<li> <b>Primul diapozitiv</b> va fi de tip titlu 	&#351;i va con&#355;ine titlul &bdquo;Suceava, loc de popas&rdquo;.</li>
<li> <b>Al doilea diapozitiv</b> va fi de tip titlu &#351;i text. Titlul – &bdquo;Obiective turistice&rdquo; va fi scris cu font Poor
Richard, culoare maro, dimensiune 54. Textul va con&#355;ine:
<i>Ruinele Palatului Domnesc<br>
Complexul Muzeal Bucovina<br>
Muzeul Satului din Bucovina<br>
Muzeul Ciprian Porumbescu<br>
Muzeul Etnografic al Bucovinei<br>
Parcul central<br>
Muzeul de istorie<br>
Casa de cultura</i>
</li>
<li>Aplica&#355;i un efect de anima&#355;ie de tip Intrare – Romb titlului &#351;i un efect de anima&#355;ie de tip Intrare –
Dezvelire marcatorilor de mai sus.</li>
 <li> <b>&#206;n diapozitivul trei</b> insera&#355;i un tabel ce con&#355;ine num&#259;rul de vizitatori estima&#355;i 	&#238;ntr-un an
calendaristic pentru obiectivele turistice enumerate mai sus.</li>
 <li> Folosind datele din diapozitivul precedent, ad&#259;uga&#355;i 	&#238;n diapozitivul patru o diagram&#259; de tip &bdquo;Structura radial&#259;&rdquo;. Titlu diagramei va fi Obiective turistice, al axei X – numele obiectivului &#351;i al axei Z – num&#259;rul de vizitatori.</li>
 <li> <b>Diapozitivul cinci</b> va con&#355;ine o imagine potrivit&#259; cu titlul din diapozitivul 1 care va fi	&#238;ncorporata
	&#238;n fundal. Ad&#259;uga&#355;i apoi o caset&#259; text ce va con&#355;ine textul &bdquo;<i>Oamenii au 	&#238;nf&#259;&#355;i&#351;area locurilor 	&#238;n care
s-au n&#259;scut</i>&rdquo;, scris cu fontul Castellar, culoarea galben&#259;, dimensiune 40.</li>
 <li> <b> &#206;n diapozitivul &#351;ase</b> insera&#355;i dou&#259; butoane de ac&#355;iune. Primul face trecerea c&#259;tre urm&#259;torul link
&bdquo;<i>http://www.turistik.ro/romania/suceava/obiective-turistice-suceava</i>&rdquo;, iar cel de-al doilea c&#259;tre ultimul diapozitiv.</li> 
     <li>Insera&#355;i în <b>diapozitivul 9</b>, textul &bdquo;V&#259; invit&#259; la SUCEAVA!&rdquo; scris cu fontul Informal Roman, dimensiunea 60 &#351;i stema Sucevei.</li>
 <li> &#206;n <b>diapozitivul 	&#351;apte</b> insera&#355;i dou&#259; gifuri animate despre un ora&#351;.</li>
 <li> <b>&#206;n diapozitivul 8</b> insera&#355;i un SmartArt – Ciclic de forma celui de mai jos.</li>
       <img src="fisa13.png">
 <li> Ad&#259;uga&#355;i fiec&#259;rui diapozitiv un fundal diferit (mai pu&#355;in diapozitivului 5) 	&#351;i aplica&#355;i o tranzi&#355;ie
     aleatoare 	&#238;ntregii prezent&#259;ri.</li> 
     <li>Salva&#355;i fi&#351;ierul cu numele Suceava. </li>
        </ol>
   </body>
</html>
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    </html>