<!DOCTYPE html>
<html>
    <head>
        <title>Fisa Word 6</title>

        <meta charset="utf-8"> 
        <meta name="viewport" content="width=device-width, initial-scale=1.0"> 
    </head>
    <body style="font-size:20px;">
        <h4>Documente WORD 2022 – Fi&#351;e de lucru</h4>

                <h1 style="text-align: center">F I Ş  A  Nr. 6</h1>

        <ol>
            <li>Edi&#355;ati utiliz&#226;nd programul Word urm&#259;torul text:</li><br>
                <p>
                    Unul din scopurile pentru care a fost creat&#259; &#351;i dezvoltat&#259; tehnologia informa&#355;iei &#351;i a <br>
                    comunica&#355;iilor a fost cre&#351;terea productivit&#259;&#355;ii muncii. Dar s-a constatat, &#238;n cazul persoanelor care<br> 
                    lucreaz&#259; intensiv la calculator, c&#259; de multe ori, productivitatea muncii nu este foarte crescut&#259;, din <br>
                    cauza unei pozi&#355;ii inadecvate &#238;n timpul lucrului la calculator. O dat&#259; cu cre&#351;terea gradului de <br>
                    folosire a calculatorului &#238;n activit&#259;&#355;ile zilnice &#351;i a cre&#351;terii num&#259;rului de persoane care i&#351;i petrec <br>
                    foarte mult timp lucr&#226;nd la calculator, a crescut &#351;i interesul pentru studiile ergonomice asupra <br>
                    factorului uman &#238;n interac&#355;iune cu calculatorul. 
                </p>
                <br>
            <li>Pe discul C realiza&#355;i un director cu numele vostru de familie. </li>
            <li>Salva&#355;i &#238;n acest director fi&#351;ierul realizat anterior cu numele REDACTARE.</li>
            <li>Realiza&#355;i o copie a acestui fi&#351;ier &#351;i salva&#355;i-o tot &#238;n acest director.</li>
            <li>Redenumi&#355;i copia realizat&#259; cu numele REDACTARE2.</li>
            <li>Fi&#351;ierul REDACTARE2 muta&#355;i-l pe desktop.</li>
            <li>Copia&#355;i textul scris anterior &#351;i apoi muta&#355;i-l &#238;ntr-un fi&#351;ier de tip Wordpad cu numele REDACTARE3 .</li>
            <li>In fi&#351;ierul REDACTARE ad&#259;uga&#355;i &#238;n partea de sus a textului un titlu: TEHNOLOGIA INFORMATIEI.</li>
            <li>Utiliz&#226;nd Internetul ad&#259;uga&#355;i &#238;n fi&#351;ierul REDACTARE o imagine cu un calculator sub textul editat anterior.</li>
            <li>Utiliz&#226;nd Internetul ad&#259;uga&#355;i &#238;n fi&#351;ierul REDACTARE o imagine cu un manual de informatic&#259; sub titlu.</li>
            <li>Utiliz&#226;nd adresa voastr&#259; de mail trimite&#355;i ca fi&#351;ier ata&#351;at fi&#351;ierul REDACTARE la adresa   ..........@yahoo.com.</li>
        </ol>
    </body>
</html>