<html>
    <head>
        <link rel="stylesheet" href="carddeckslideshow.css" />

        <style>

        .stackcontainer{
        margin: 100px 0 10px 0;
        }

        #demo1{
            width: 80%; 
            height: 70%;
            margin-left: 20px;
        }

        #demo1 h4{
            margin: 0;
            text-align: center;
        }


        </style>

        <script type="text/javascript" src='https://cdnjs.cloudflare.com/ajax/libs/jquery/2.1.3/jquery.min.js'></script>

        <script src="carddeckslideshow.js">

        /*
        * Card Deck Slideshow (c) Dynamic Drive (www.dynamicdrive.com)
        * Last updated: May 2nd, 13'
        * Visit http://www.dynamicdrive.com/ for this script and 100s more.
        */

        </script>

        <script>

        var demo1 = new carddeckslideshow({
            id: 'demo1',
            autoplay: true,
            cycles: 2,
            persist: false
        })

        </script>
    </head>
    <body>
        <div id="demo1" class="stackcontainer">
            <div class="inner">
                <div>
                    <h4>Adresa IP</h4><br>
                    - <a href="https://en.wikipedia.org/wiki/Internet_Protocol"><b>IP (Internet Protocol)</b></a>  este un protocol care asigur&#259; un serviciu de transmitere a datelor, f&#259;r&#259; conexiune permanent&#259;. Acesta identific&#259; fiecare interfa&#355;&#259; logic&#259; a echipamentelor conectate printr-un num&#259;r numit "adres&#259; IP". Versiunea standard folosit&#259; &#238;n majoritatea cazurilor este IPv4. &#238;n IPv4, standardul curent pentru comunicarea &#238;n Internet, adresa IP este reprezentat&#259; pe 32 de bi&#355;i (de ex. 192.168.0.1). Alocarea adreselor IP nu este arbitrar&#259;; ea este realizat&#259; de c&#259;tre organiza&#355;ii &#238;ns&#259;rcinate cu distribuirea de spa&#355;ii de adrese.<br>
                    - Protocolul Internet este protocolul care define&#351;te &#351;i permite interconectarea la nivelul Retea al modelului TCP. Utilizeaz&#259; un sistem de adresare logic &#351;i efectueaz&#259; rutarea, care este redirec&#355;ionarea pachetelor de la o gazd&#259; surs&#259; la urm&#259;torul router care este cu un salt mai aproape de gazda destina&#355;ie dorit&#259; pe o alt&#259; re&#355;ea.<br>
                    - IPv4 este un protocol f&#259;r&#259; conexiune &#351;i func&#355;ioneaz&#259; pe un model de livrare cu cel mai mic efort, prin faptul c&#259; nu garanteaz&#259; livrarea &#351;i nici nu asigur&#259; o secven&#355;iere adecvat&#259; sau evitarea livr&#259;rii duble. Aceste aspecte, inclusiv integritatea datelor, sunt abordate de un protocol de transport de nivel superior, cum ar fi Transmission Control Protocol (TCP).<br>
                    - Adresele IPv4 pot fi reprezentate &#238;n orice nota&#355;ie care exprim&#259; o valoare &#238;ntreag&#259; de 32 de bi&#355;i. Ele sunt cel mai adesea scrise &#238;n nota&#355;ie punct-zecimal&#259;, care const&#259; din patru octe&#355;i ai adresei exprimate individual &#238;n numere zecimale &#351;i separate prin puncte.<br>
                    - De exemplu, adresa IP 172.16.254.1 reprezint&#259; num&#259;rul zecimal de 32 de bi&#355;i 2886794753, care &#238;n format hexazecimal este 0xAC10FE01.
                </div>
            </div>

            <div class="inner">
                <div>
                    <h4>DHCP (Dynamic Host Configuration Protocol)</h4><br>
                    - <a href="https://en.wikipedia.org/wiki/Dynamic_Host_Configuration_Protocol"><b>DHCP (Dynamic Host Configuration Protocol)</b></a> este un protocol TCP/IP care d&#259; posibilitatea unei re&#355;ele private, conectate la internet, s&#259; aloce o adres&#259; IP unui calculator gazd&#259; care urmeaz&#259; a se conecta la acea re&#355;ea. DHCP este un mediu client server, urma&#351; al protocolului BOOTP, utilizat pentru alocarea dinamic&#259; a adreselor de IP, serverelor DNS (Domain Name Service), WINS (Windows Internet Name Service ) &#351;i a default gateway.<br>
                    - <b>DHCP</b> a fost proiectat &#351;i dezvoltat de Internet Engeneering Task Force (IETF). Microsoft a fost prima firm&#259; care a introdus &#238;n 1994 DHCP, odat&#259; cu lansarea lui Windows NT Server 3.5.<br>
                    - <b>DHCP</b> este complet definit de urm&#259;toarele Request For Comments:
                    <ul>
                        <li>RFC 1533: DHCP options and BOOTP Vendor extension</li>
                        <li>RFC 1534: Interoperation between DHCP and BOOTP</li>
                        <li> RFC 1541: DHCP</li>
                    </ul>
                    - <b>Functionare</b> <br>
                    Clien&#355;ii DHCP caut&#259; &#238;n re&#355;ea servere DHCP, de la care &#238;ncearc&#259; s&#259; ob&#355;in&#259;, pe o durat&#259; limitat&#259; de timp, o identitate (adres&#259; IP, masc&#259; de re&#355;ea, adres&#259; pentru default gateway). Procesul se desf&#259;&#351;oar&#259; &#238;n patru pa&#351;i :
                    <ul>
                        <li><b><i>Discover</i></b> - clientul caut&#259; un server disponibil pentru a-&#351;i transmite mesajul</li>
                        <li><b><i>Offer</i></b> - oferta DHCP c&#259;tre client</li>
                        <li><b><i>Request</i></b> - cererea adresat&#259; de client serverului DHCP ales</li>
                        <li><b><i>Acknowledgment</i></b> - serverul transmite clientului pachetul de date solicitat.</li>
                    </ul>
                </div>
            </div>

            <div class="inner">
                <div>
                    <h4>Domain Name Server (DNS)</h4><br>   
                    - Un server de nume domeniu, Domain Name Server (DNS), este un program software, care ascult&#259; cereri pe un port standard (53) &#351;i care ruleaz&#259; pe un calculator conectat permanent (de obicei) la Internet.<br>
                    - <a href="https://en.wikipedia.org/wiki/Domain_Name_System">DNS (Domain Name System)</a> este un serviciu de registru Internet distribuit. DNS translateaz&#259; ("mapeaz&#259;") numele de domeniu (sau nume ale ma&#351;inilor de calcul) &#238;n adrese IP &#351;i adresa IP &#238;n nume. Translatarea numelui &#238;n adresa IP se nume&#351;te "rezolvarea numelui de domeniu".<br>
                    - <b>Maparea</b> este o simpl&#259; asociere &#238;ntre dou&#259; elemente, &#238;n acest caz un nume de ma&#351;in&#259;, ca ftp.linux.org, &#351;i IP -ul ma&#351;inii (sau adresa) 199.249.150.4. Un calculator se identific&#259; printr-o adres&#259;, unic&#259; &#238;n Internet, numit&#259; adresa IP a calculatorului respectiv. Totodat&#259; calculatorul poate avea asociat &#351;i un nume. Astfel, adresa IP este utilizat&#259; la nivelul programelor de prelucrare &#238;n reţea. &#238;n schimb, la nivelul utilizatorilor cu acces la mediul Internet, identificarea calculatoarelor se face printr-un nume de calculator host gestionat de sistemul DNS.<br>
                    - Sistemul de nume din Internet este structurat pe domenii &#351;i subdomenii. Considerând un server de nume (name server) admin.rdslink.ro, domeniul cel mai larg este ro, care include domeniul rdslink.ro, iar admin este un computer din cadrul domeniului rdslink.ro. Deci luând de la dreapta la stânga un nume, pe cea mai din dreapta poziţie se afl&#259; domeniul cel mai general, dup&#259; care urmeaz&#259;, &#238;n ordinea subordon&#259;rii, restul subdomeniilor. Pe cea mai din stânga poziţie se afl&#259; numele computerului.<br>
                    - &#206;n Internet exist&#259; domenii dedicate (standardizate). Iat&#259; câteva dintre ele: com desemneaz&#259; domeniul comercial, edu desemneaz&#259; domeniul educaţional, gov - domeniul guvernamental, mil - domeniul militar, org - alte organizaţii, net - resurse de reţea, int - resurse internaţionale, etc.
                    Extinderea Internet-ului &#238;n diferite ţ&#259;ri a dus la crearea de domenii pentru fiecare ţar&#259;: ro - România, fr - Franţa, it - Italia, uk - Marea Britanie, us - USA, etc.
                </div>
            </div>
            
            <div class="inner">
                <div>
                Ontario is a province located in the central part of Canada, the largest by population and second largest, after Quebec in total area. Toronto, the capital of Ontario, is the centre of Canada's financial services and banking industry.
                </div>
            </div>

        </div>

        <div style="margin-top:1em; margin-left:100px">
        <a href="javascript:demo1.navigate('prev')">&#206;napoi</a> / <a href="javascript:demo1.navigate('next')">&#206;nainte</a> 
        </div>
    </body>
</html>
