<html>
    <head>
        <title>FTP, UDP</title>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <link rel="stylesheet" href="host_client.css">
    </head>
    <body>
        <div class="site">
            <div class="titlu">
                <h1 align="center">FTP</h1>
            </div>
            <h3><strong>Ce este FTP? </strong></h3>
                <p align="justify">Protocolul transfer de fi&#351;iere (<em><strong>FTP - File Transfer Protocol</strong></em>) serve&#351;te la conectarea a dou&#259; ma&#351;ini &#238;n vederea transferului de fi&#351;iere &#238;ntre ele printr-o re&#355;ea bazat&#259; pe TCP, cum ar fi Internetul. Persoanele utilizeaz&#259; de obicei FTP pentru a face fi&#351;ierele disponibile pentru desc&#259;rcare, dar exist&#259; &#351;i posibilitatea de a utiliza FTP pentru a &#238;nc&#259;rca pagini Web, pentru a construi un site Web sau pentru a &#238;nc&#259;rca fotografii digitale de pe un site de partajare a imaginilor. <br>
                 In cazul FTP conexiunea este temporar&#259; &#351;i serve&#351;te pentru a copia (download, get) sau a trimite (upload, put) fi&#351;iere. Dup&#259; terminarea transferului (sau transferurilor), utilizatorul opre&#351;te sesiunea FTP.<br>
                Unul dintre principalele motive pentru care companiile au nevoie de FTP este capacitatea sa de a efectua transferuri de fi&#351;iere mari. Atunci c&#226;nd trimite&#355;i un fi&#351;ier relativ mic, cum ar fi un document Word, majoritatea metodelor vor func&#355;iona, dar cu FTP, pute&#355;i trimite sute de gigaocte&#355;i simultan.     
                </p>
            <h3>Desf&#259;&#351;urarea unei sesiuni </h3>
                <ul>
                    <li>Sesiunea este ini&#355;ializat&#259; de programul FTP client, c&#259;ruia i se comunic&#259; adresa la care trebuie s&#259; se conecteze (ftp.netscape.com).</li> 
                    <li>Dup&#259; stabilirea leg&#259;turii, serverul cere numele utilizatorului (username, login, login name) &#351;i parola (password). </li>
                    <li>Odat&#259; identificat utilizatorul, acesta dispune de un set de comenzi care &#238;i permit s&#259; exploreze sistemul de fi&#351;iere ale serverului &#351;i s&#259; copieze fi&#351;ierele dorite. </li>
                    <li>Dup&#259; localizarea fi&#351;ierului, utilizatorul trece &#238;n mod binar (bin) &#351;i d&#259; comanda de copiere (get fis.txt). </li>
                    <li>Dup&#259; copierea fi&#351;ierului, utilizatorul poate &#238;ntrerupe conexiunea FTP prin comanda quit (sau bye), sau poate ini&#355;ia alte transferuri. </li>
                </ul>
            <h3 align="center">Comenzi pentru conectare, deconectare &#351;i identificare</h3>
                <table border="1" width="100%">
                  <tr>
                    <td width="19%" valign="center"><p align="center">open</td>
                    <td width="81%" valign="top"><div align="justify">Indic&#259; serverul la care se dore&#351;te s&#259; se realizeze o conexiune. Serverul poate fi specificat fie utiliz&#226;nd numele complet (exemplu: <i>masina.subdomeniu.domeniu</i>) fie prin specificarea adresei IP (exemplu: <i>193.231.19.225</i>).</div> </td>
                  </tr>
                  <tr>
                    <td width="19%" valign="center"><p align="center">user nume-user</td>
                    <td width="81%" valign="top"><div align="justify">Trimite noi informa&#355;ii de identificare. &#206;n cazul &#238;n care se introduce gre&#351;it numele de utilizator sau parola, se utilizeaz&#259; aceast&#259; comand&#259; pentru a indica numele corect de utilizator &#351;i parola.  </div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="center"><p align="center">close</td>
                    <td width="81%" valign="top">Permite &#238;nchiderea leg&#259;turii cu serverul curent, pentru a se
                    putea realiza o legatur&#259; cu un alt server. </td>
                  </tr>
                  <tr>
                    <td width="19%" valign="center"><p align="center">bye, exit</td>
                    <td width="81%" valign="top">&#206;nchide programul ftp &#351;i a leg&#259;turii la serverul curent
                    (dac&#259; exist&#259; o legatur&#259; deschis&#259;). </td>
                  </tr>
                </table>
            <h3 align="center">Comenzi pentru manipularea fi&#351;ierelor, directoarelor &#351;i vizualizarea
                con&#355;inutului directoarelor</h3>
                <table border="1" width="100%">
                  <tr>
                    <td width="19%" valign="middle" align="center">cd <em>director</em></td>
                    <td width="81%"><div align="justify">Schimb&#259; directorul curent pe calculatorul la distan&#355;&#259; &#238;n <em>director</em>.</div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="middle" align="center">lcd <em>director</em></td>
                    <td width="81%"><div align="justify">Schimb&#259; directorul curent pe calculatorul local &#238;n <em>director</em>.</div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="middle" align="center">pwd</td>
                    <td width="81%"><div align="justify">Afi&#351;eaz&#259; directorul curent pe calculatorul la distan&#355;&#259;.</div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="middle" align="center">ls<br>
                    dir</td>
                    <td width="81%"><div align="justify">Afi&#351;eaz&#259; con&#355inutul directorului curent de pe calculatorul local.</div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="middle" align="center">mkdir <em>director</em></td>
                    <td width="81%"><div align="justify">Creeaz&#259; directorul specificat ca subdirector al directorului curent de pe calculatorul la distan&#355;&#259;. </div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="middle" align="center">rmdir <em>director</em></td>
                    <td width="81%"><div align="justify">&#350;terge directorul specificat de pe calculatorul la distan&#355;&#259;. Trebuie s&#259; existe
                      dreptul de modificare / &#351;tergere a directorului respectiv, &#238;n func&#355;ie de sistemul de operare al calculatorului la distan&#355;&#259;.</div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="middle" align="center">delete file</td>
                    <td width="81%"><div align="justify">&#350;terge fi&#351;ierul specificat de pe calculatorul la distan&#355;&#259;.</div></td>
                  </tr>
                </table>
            <h3 align="center">Comenzi pentru transferul de fi&#351;iere</h3>
                <table border="1" width="100%">
                  <tr>
                    <td width="19%" valign="middle" align="center">get fisier1 [fisier2]</td>
                    <td width="81%"><div align="justify">Transfer&#259; fi&#351;ierul <em>fisier1</em> de pe calculatorul la distan&#355;&#259; pe calculatorul local. Dac&#259; <em>fisier2</em> lipse&#351;te, acest fi&#351;ier va fi plasat cu numele <em>fisier1</em> pe calculatorul local, altfel va fi plasat cu numele <em>fisier2</em>. Transferul se realizeaz&#259; utiliz&#226;nd modul de transfer activ (binar sau text).</div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="middle" align="center">put fisier1 [fisier2]</td>
                    <td width="81%"><div align="justify">Transfera fi&#351;ierul <em>fisier1</em> specificat de pe calculatorul local pe calculatorul la distan&#355;&#259;. Dac&#259; <em>fisier2 </em>lipse&#351;te, fi&#351;ierul transferat va fi plasat cu numele <em>fisier1</em> pe calculatorul la distan&#355;&#259;, altfel va fi plasat cu numele <em>fisier2</em>. Transferul se realizeaz&#259; utiliz&#226;nd modul de transfer activ (binar sau text).</div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="middle" align="center">mget nume*</td>
                    <td width="81%"><div align="justify">Transfer&#259; toate fi&#351;ierele din directorul curent de pe ma&#351;in&#259; la distan&#355;&#259;, fi&#351;iere al caror nume &#238;ncepe cu <em>nume</em> pe calculatorul local. Transferul se realizeaz&#259; utiliz&#226;nd
                      modul de transfer activ. Dac&#259; este activat modul interactiv, utilizatorul va fi &#238;ntrebat
                    pentru fiecare fi&#351;ier &#238;n parte dac&#259; dore&#351;te sau nu s&#259; &#238;l transfere.</div></td>
                  </tr>
                  <tr>
                    <td width="19%" valign="middle" align="center">mput nume*</td>
                    <td width="81%"><div align="justify">Transfer&#259; toate fi&#351;ierele din directorul curent de pe ma&#351;ina local&#259; al c&#259;ror nume &#238;ncepe cu<em> nume </em>pe calculatorul la distan&#355;&#259;. Transferul se realizeaz&#259; utiliz&#226;nd modul de transfer activ. Dac&#259; este activat modul interactiv, utilizatorul va fi &#238;ntrebat pentru fiecare fi&#351;ier &#238;n parte dac&#259; dore&#351;te sau nu s&#259; &#238;l transfere.</div></td>
                  </tr>
                </table>
            <div class="titlu">
                <h1 align="center">TCP</h1>
            </div>
                <p>TCP creeaz&#259; o linie de comunica&#355;ie sigur&#259; pentru a asigura transmiterea fiabil&#259; a tuturor datelor. Odat&#259; ce un mesaj este trimis, se verific&#259; dac&#259; toate datele au fost transferate.<br>
                Conexiunea dintre emi&#355;&#259;tor &#351;i destinatar este men&#355;inut&#259; p&#226;n&#259; c&#226;nd transferul este reu&#351;it. De fiecare dat&#259; c&#226;nd este trimis un pachet de date, acesta necesit&#259; o confirmare din partea receptorului. Deci, dac&#259; nu se prime&#351;te nicio confirmare, datele sunt retrimise.</p>
                Activa&#355;i TCP pentru urm&#259;toarele activit&#259;&#355;i:
                <ul>
                    <li>E-mail &#351;i mesaje text;</li>
                    <li>Transmitere con&#355;inut pre&#238;nregistrat de pe site-uri precum Netflix, Hulu sau HBO Max;</li>
                    <li>Transferarea fi&#351;ierelor &#238;ntre aplica&#355;ii &#351;i dispozitive;</li>
                    <li>Navigare general&#259; pe web;</li>
                    <li>Administrarea de la distan&#355;&#259; a dispozitivului sau a re&#355;elei.</li>
                </ul>
            <div class="titlu">
                <h1 align="center">UDP</h1>
            </div>
            <p align="justify">UDP(User Datagram Protocol) nu stabile&#351;te o conexiune la trimiterea datelor. Trimite pachete independente de date, numite datagrame, f&#259;r&#259; s&#259; confirme primirea sau s&#259; verifice erorile. Aceasta &#238;nseamn&#259; c&#259; unele sau toate datele se pot pierde &#238;n timpul transmisiei. Avantajul folosirii acestui protocol este reprezentat de laten&#355;a scazut&#259; (delay) &#351;i permite fluiditatea aplica&#355;iei f&#259;r&#259; int&#226;rzieri.
            </p>
            Activa&#355;i UDP pentru urm&#259;toarele activit&#259;&#355;i:
                <ul>
                    <li>Jocuri online;</li>
                    <li>Multicasting;</li>
                    <li>Video chat(conferin&#355;&#259;);</li>
                    <li>VoIP (apel vocal &#238;n aplica&#355;ie);</li>
                    <li>Domain Name Systems (care traduce numele de domenii &#238;n adrese IP).</li>
                </ul>
        </div>        
    </body>
</html>