<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <link rel="stylesheet" href="host_client.css">
        <title>Host &#351;i Client</title>
    </head>
    <body>
        <div class="site">
            <div class="titlu">
                <h1>Host &#351;i Client</h1>
            </div>
            <p><span class="p1">“Host”</span> (cu traducerea &#238;n englez&#259; “gazd&#259;”) este un calculator conectat la o re&#355;ea,pun&#226;nd la dispozi&#355;ie celorlaltor calculatoare din re&#355;ea unele resurse ale sale (fi&#351;iere,aplica&#355;ii &#351;.a.). &#206;n acest caz celelalte calculatoare se mai desemneaz&#259; &#351;i drept guest („oaspete”).</p>
            <p>Host este un computer conectat la internet ce g&#259;zduiete pagini web &#351;i furnizeaz&#259; vizitatorilor un server dedicat-care g&#259;zduiete un singur site web.Un server ne-dedicat g&#259;zduiete mai multe pagini web.</p>
            <p>Serverele dedicate sunt mai rapide,dar i considerabil mai scumpe. Pe de alta parte,Client este un computer care se conecteaz&#259; la un server prin diverse protocoale sau aplica&#355;ii pentru a apela la serviciile acestuia.</p>
            <p>Un <span class="p3">client</span> este o unitate hardware sau software informatic (calculator sau program), care acceseaz&#259; un serviciu disponibil printr-un server. Serverul este adesea (dar nu mereu) un alt sistem de calculatoare, &#238;n acest caz clientul acces&#226;nd serviciul prin intermediul unei re&#355;ele de calculatoare.</p>
            <p>&#206;n ultimii ani se prefer&#259; totu&#351;i folosirea termenilor server (&#238;n loc de host) &#351;i <span class="p2">client</span> (&#238;n loc de guest).</p>          
            <img src="imagine2.webp" class="img2">
            <div class="titlu">
                <h1>WWW (World Wide Web)</h1>
            </div>
            <p><span class="p1">World Wide Web</span> (sau simplu Web ) reprezint&#259; ansamblul documentelor de natur&#259; hypertext distribuite fie pe Internet, fie &#238;n re&#355;elele locale. Aceste documente distribuite pe Web (numite &#351;i pagini web) sunt scrise &#238;n limbaj HTML. Implement&#259;rile Web urmeaz&#259; un model standard de programe client – server. Arhitectura WWW este una a clien&#355;ilor (precum Mozila Firefox, Edge, Opera etc..), care &#351;tiu cum s&#259; prezinte datele.</p>
            <div class="titlu">
                <h1>HTTP - HyperText Transfer Protocol</h1>
            </div>
            <p><span class="p1">HTTP</span> - HyperText Transfer Protocol reprezint&#259; un protocol de comunicare &#238;n re&#355;ea, special proiectat pentru Web. Acest protocol dirijeaz&#259; toate opera&#355;iunile dintre browser &#351;i serverul de Web.
            </p>
            <p><span class="p1">Browser-ul</span>  (aplica&#355;ia client ce folosete protocolul HTTP pentru a primi informa&#355;ii) &#351;i serverul (aplica&#355;ia care ruleaz&#259; pe computerul ce stocheaz&#259; informa&#355;iile) trebuie s&#259; realizeze o conexiune la internet &#351;i apoi s&#259; o &#238;ntrerup&#259;, pentru fiecare opera&#355;ie HTTP. De exemplu: dac&#259; este solicitat&#259; conectarea la un site Web, browser-ul (clientul) &#351;i serverul creaz&#259; o leg&#259;tur&#259; ce permite serverului s&#259; trimit&#259; clientului fiierul HTML solicitat. Dup&#259; ce clientul prelucreaz&#259; fiierul HTML &#351;i constat&#259; c&#259; &#238;i mai sunt necesare &#351;i alte fiiere, el trebuie s&#259; ini&#355;ieze o nou&#259; conexiune la server. Fiecare opera&#355;ie HTTP este numit&#259; tranzac&#355;ie. Protocolul HTTP folosete o conexiune TCP/IP care este men&#355;inut&#259; pe durata unei singure tranzac&#355;ii.
            </p>
            <p><span class="p1">HTTP </span>(Hypertext Transfer Protocol) este metoda cea mai des utilizat&#259; pentru accesarea informa&#355;iilor p&#259;strate pe servere World Wide Web (WWW). Protocolul HTTP este de tip text, fiind protocolul "implicit" al WWW. HTTP presupune c&#259; pe calculatorul destina&#355;ie ruleaz&#259; un program care &#238;n&#355;elege protocolul. Fi&#351;ierul trimis la destina&#355;ie poate fi un document HTML (Hyper Text Markup Language), un fiier grafic, de sunet, anima&#355;ie sau video, de asemenea un program executabil pe server-ul respectiv sau/&#351;i un editor de text. Conform modelului TCP/IP, protocolul HTTP este de nivel aplica&#355;ie. Realizarea &#351;i evolu&#355;ia sa sunt coordonate de c&#259;tre World Wide Web Consortium (W3C).
        </div>
    </body>
</html>
