<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <link rel="stylesheet" href="host_client.css">
        <title>Modem</title>
    </head>
    <body>
        <div class="site">
            <div class="titlu">
                <h1 align="center">Modemul</h1>
            </div>
            <p align="justify"> Modemul este un dispozitiv care permite conectarea calculatoarelor la distan&#355;&#259;, transferul datelor realiz&#226;ndu-se printr-un mediu de transmisie (linie telefonic&#259;, unde radio). </p>
            <p align="justify">Denumirea dispozitivului provine din cele dou&#259; roluri pe care le are &#238;ntr-o re&#355;ea: modulare-demodulare, adic&#259; transformarea semnalului digital de la ie&#351;irea calculatorului &#238;n semnal analogic (und&#259; sinusoidal&#259;), pentru a putea fi purtat de mediul de transmisie spre cel&#259;lalt calculator, unde este realizat&#259; transformarea invers&#259; a semnalului - din analogic &#238;n digital. Un modem de linie telefonic&#259; va converti nivelele logice 0 &#351;i 1, prin care sunt reprezentate datele &#238;n calculator (sistem binar), &#238;n diferite tonuri. &#206;n transmisia pe liniile telefonice, frecven&#355;a tonurilor trebuie s&#259; apar&#355;in&#259; spectrului audio. Pentru a permite comunica&#355;ia &#238;n ambele direc&#355;ii simultan (full-duplex), sunt necesare 4 tonuri diferite, c&#226;te dou&#259; pentru fiecare direc&#355;ie. Un tip de modem mai performant este cel conectat prin re&#355;eaua de cablu TV. Modemul de cablu este preferabil celui de dial-up, deoarece abonatul la Internet are conexiune permanent&#259;, iar viteza de transfer este mai mare dec&#226;t &#238;n cazul conexiunii dial-up. &#206;n re&#355;elele de mare vitez&#259;/mare distan&#355;&#259; sunt necesare modemuri corespunz&#259;toare: radiomodem-urile. Acestea permit func&#355;ionarea simultan&#259; &#238;n mai multe frecven&#355;e, fiind dotate cu un controller care previne coliziunea pachetelor de date &#351;i transmisia eronat&#259; a acestora. </p>          
            <img src="modem_1.png" class="img2">
            <p>Un parametru esenţial pentru un modem este viteza de transmisie, măsurată în multipli de biţi pe secundă (bps).</p>
            <p align="justify"> Din punct de vedere al amplas&#259;rii &#238;n raport cu computerul, modem- urile pot fi : </p>
            <p align="justify">&#149;&nbsp; <strong>Externe</strong>: cele care sunt plasate &#238;n afara unit&#259;&#355;ii centrale </p>
            <p align="justify">&#149;&nbsp; <strong>Interne</strong>: cele care se g&#259;sesc &#238;n interiorul unit&#259;&#355;ii centrale; se instaleaz&#259; &#238;ntr-un slot PCI sau ISA, av&#226;nd integrat portul serial propriu. </p>
            <div class="titlu">
                <h1 align="center">Firewall</h1>
            </div>
            <p align="justify">Un paravan de protec&#355;ie (<strong>firewall-ul</strong>) poate &#355;ine la distan&#355;&#259; traficul Internet care poate afecta sistemul calculatorului: hackeri, worms &#351;i anumite tipuri de viru&#351;i. Acesta mai poate &#238;mpiedica participarea computerului la un atac &#238;mpotriva altor calculatoare, f&#259;r&#259; cuno&#351;tin&#355;a sau voin&#355;a utilizatorului. </p>
            <h2>Modul de func&#355;ionare al unui firewall: </h2>
            <p align="justify">Un firewall coopereaz&#259; &#238;ndeaproape cu un program de routare, care examineaz&#259; fiecare pachet de date din re&#355;ea (cea local&#259; sau cea exterioar&#259;) ce va trece prin serverul <strong>gateway</strong>, pentru a hot&#259;r&#238; dac&#259; va fi trimis mai departe spre destina&#355;ie sau nu. De asemenea, un firewall include sau lucreaz&#259; &#238;mpreun&#259; cu un server <strong>proxy </strong> care face cereri de pachete &#238;n numele sta&#355;iilor de lucru ale utilizatorilor. </p>
            <p align="justify"><strong>Un firewall </strong> este folosit pentru dou&#259; scopuri: </p>
            <p align="justify">&#149;&nbsp; pentru a &#355;ine &#238;n afara re&#355;elei utilizatorii r&#259;u inten&#355;ionati (viru&#351;i, worms, hackeri, crackeri) </p>
            <p align="justify">&#149;&nbsp; pentru a deservi utilizatorii locali &#238;n re&#355;ea &#238;n mod normal, conform autoriz&#259;rilor respective. </p>
            <div class="titlu">
                <h1>Motor de căutare</h1>
            </div>
            <p align="justify">Un motor de căutare este un sistem software care găsește pagini web care corespund unei căutări web. Acesta caută pe World Wide Web într-un mod sistematic pentru anumite informații specificate într-o interogare de căutare web textuală. Rezultatele căutării sunt, în general, prezentate într-o linie de rezultate, adesea denumite pagini de rezultate ale motorului de căutare (SERP). Informațiile pot fi un amestec de hyperlinkuri către pagini web, imagini, videoclipuri, infografice, articole și alte tipuri de fișiere. Din ianuarie 2022, Google este de departe cel mai folosit motor de căutare din lume, cu o cotă de piață de 90,6%, iar celelalte motoare de căutare cele mai utilizate din lume au fost Bing, Yahoo!, Baidu, Yandex și DuckDuckGo.
            </p>
            <p align="justify">În 1996, Robin Li a dezvoltat algoritmul de punctare a site-urilor RankDex pentru clasarea paginilor cu rezultate ale motoarelor de căutare și a primit un brevet american pentru această tehnologie. A fost primul motor de căutare care a folosit hyperlinkuri pentru a măsura calitatea site-urilor web pe care le indexa. Un algoritm foarte asemănător a fost dezvoltat de Google doi ani mai târziu, în 1998. Larry Page a făcut referire la munca lui Li în unele dintre brevetele sale din SUA pentru PageRank. Ulterior, Li și-a folosit tehnologia Rankdex pentru motorul de căutare Baidu, care a fost fondat de el în China și lansat în 2000.
            </p>
        </div>
    </body>
</html>
