<!DOCTYPE html>
<html>
    <head>
        <title>Fi&#351;a de lucru 4</title>
    </head>
    <body>
        <h1>Lucrare practic&#259; editare text</h1>
        <h2>PLOAIA ACID&#258;</h2>
            <p>      Ploaia acid&#259; este o form&#259; de poluare at&#226;t a aerului c&#226;t 	&#351;i a apei &#238;n care acizii din aer, produ&#351;i de uzine de producere a energiei electrice 	&#351;i alte surse, cad pe Pam&#226;nt &#238;n diferite regiuni. Ac&#355;iunea corosiva a ploii acide provoac&#259; pagube incomensurabile mediului inconjur&#259;tor. Problema &#238;ncepe cu producerea dioxidului de sulf 	&#351;i a oxizilor de azot produsi prin arderea combustibilului fosil (c&#259;rbune, gaz natural &#351;i petrol). Dioxidul de sulf &#351;i oxizii de azot reactioneaz&#259; cu apa, &#351;i alte substan&#355;e chimice din aer, pentru a forma acidul sulfuric, acidul azotic &#351;i al&#355;i poluan&#355;i. Ace&#351;ti acizi poluan&#355;i ajung p&#226;na &#238;n atmosfer&#259;, unde c&#259;l&#259;toresc sute de kilometri, &#351;i, &#238;n cele din urm&#259;, se &#238;ntorc pe p&#259;m&#226;nt sub forma de ploaie, z&#259;pad&#259; sau cea&#355;&#259;.
            </p>
            <p>      Urm&#259;ri ale ploii acide pot fi observate mai ales &#238;n estul Americii de Nord, &#238;n Europa, &#238;n Japonia, China &#351;i Sud-Estul Asiei. Ploaia acid&#259; &#238;ndep&#259;rteaz&#259; substan&#355;ele nutritive din p&#259;m&#226;nt, &#238;ncetine&#351;te dezvoltarea copacilor &#351;i transform&#259; lacurile &#238;ntr-un mediu care nu poate &#238;ntre&#355;ine via&#355;a. &#206;n orase, acizii poluan&#355;i corodeaz&#259; aproape tot ce intr&#259; &#238;n contact cu ei, acceler&#226;nd acest proces asupra structurilor cum ar fi blocuri &#351;i statui. Acizii &#238;n combina&#355;ie cu alte substan&#355;e chimice formeaz&#259; praful de fum urban care atac&#259; plam&#226;nii, cauz&#226;nd boli &#351;i decese premature.
            </p>
            <ol>
                <li>Deschide&#355;i aplica&#355;ia MicrosoftWord</li>
                <li>Introduce&#355;i textul de mai sus text, Times New Roman, m&#259;rimea 12, spa&#355;iu &#238;ntre linii 1,5</li>
                <li>Dup&#259; cuv&#226;ntul petrol introduce&#355;i un paragraf nou.</li>
                <li> Selecta&#355;i tot textul &#351;i modifica&#355;i dimensiunea caracterelor la 14</li>
                <li>Folosi&#355;i func&#355;ia de despr&#355;ire &#238;n cuvinte pentru a separa cuvntul atmosfera</li>
                <li> Ad&#259;uga&#355;i urm&#259;torul comentariu dup&#259; Ploaie acid&#259; :”material preluat de pe internet”</li>
                <li>Selecta&#355;i paragraful al doilea &#351;i stabili&#355;i spa&#355;ierea &#238;ntre r&#226;nduri la 2 linii.</li>
                <li>Selecta&#355;i textul “Ac&#355;iunea corosiv&#259;” &#351;i scrie&#355;i-l expandat la 2pt.</li>
                <li>Transforma&#355;i literele cuv&#226;ntului Japonia &#238;n majuscule.</li>
                <li>Dup&#259; paragraful doi introduce&#355;i o &#238;ntrerupere de pagin&#259;</li>
                <li>Crea&#355;i paragrafe noi dup&#259;: estul Americii de Nord, &#238;n Europa, &#238;n Japonia, China &#351;i SudEstul Asiei.</li>
                <li>&#238;n dreptul paragrafelor noi formate ad&#259;uga&#355;i marcatori</li>
                <li>Introduce&#355;i &#238;n antet numele vostru &#351;i clasa, iar la subsol numele &#351;colii</li>
                <li>Selecta&#355;i titlul centra&#355;i-l &#351;i scrie&#355;i-l cu aldin, dimensiune 20, Castellar, culoare mov, subliniat cu linie &#238;ntrerupt&#259;, doar cuvintele, de culoare verde, introduce&#355;i-l &#238;ntr-un chenar de culoare portocalie cu fond galben</li>
                <li> Schimba&#355;i orientarea paginii a doua &#238;n landscape</li>
                <li>Introduce&#355;i urm&#259;toarea form&#259;</li>
                <img src="fisa_4_1.png">
                <li>&#206;n interiorul ei scrie&#355;i numele vostru</li>
                <li>Umple&#355;i forma cu o culoare la alegere</li>
                <li> Cu ajutorul editorului de ecua&#355;ii scrie&#355;i urm&#259;toarea rela&#355;ie matematic&#259;</li>
                <img src="fisa_4_2.png">
                <li> Salva&#355;i documentul cu numele vostru "Nume_Prenume_1.docx"</li>
                <li>Crea&#355;i o felicitare de Cr&#259;ciun, folosind imagini de pe internet</li>
                <li>Folosind Mail merge, adresa&#355;i felicitarea mai multor persoane</li>
                <li>Salva&#355;i documentul cu numele vostru "Nume_Prenume_2.docx"</li>

            </ol>
    </body>
</html>