<!DOCTYPE html>
<html lang="en">
    <head>
        <title>FisaAccess1</title>

        <meta charset="utf-8"> 

        <link rel="stylesheet" href="style.css">

    </head>
    <body>
        </br>
        <div class="box">
        <PageTitle style="text-align:center">
            <h1>
                    <u>F I &#350; A Nr. 1<br></u>
            </h1>
        </PageTitle><br>

        <ol type="A">   
            <b><li>Crearea unei baze de date pornind de la zero</li></b>
            <a href="https://support.microsoft.com/en-us/office/create-a-database-in-access-f200d95b-e429-4acc-98c1-b883d4e9fc0a">Crearea unei baze de date.</a>
            <ol type="1">
                <p>1. O s&#259; &#238;ncepem s&#259; cre&#259;m o baz&#259; de date nou&#259;. Deschidem aplica&#355;ia Microsoft Access:</p>
            </ol>

            <p style="font-size: 25px;"><i><b>D&#259;m dublu clic pe pictograma sau START programs…….</b></i></p>
            
            <ol>
                <p>
                    O s&#259; alegem <b>BlankDatabase</b>. <img src="img/1.1.png">Putem de asemenea s&#259; &#238;ncepem de la
                    un anumit &#351;ablon (template) de baz&#259; de date, deja disponibil. D&#259;m un nume acestei baze
                    de date, de exemplu <b>FIRMA.accdb</b>.
                </p>
                <p>
                    Observa&#355;i c&#259; &#351;i extensia acestei baze de date s-a schimbat. Ap&#259;s&#259;m <b>Create</b>, &#351;i &#238;n
                    acest moment putem s&#259; cre&#259;m componentele unei baze de date.<br>
                    O baz&#259; de date este format&#259; din mai multe tabele.
                    Observa&#355;i c&#259; interfa&#355;a Access porne&#351;te deja cu un tabel nou.<br>
                    O s&#259; stabilim c&#226;teva no&#355;iuni esen&#355;iale pentru lucrul cu tabele:
                    <ul style="list-style-type:disc">
                        <li>Orice coloan&#259; dintr-un tabel se nume&#351;te <b><i>field</i></b>(c&#226;mp);</li>
                        <li>Orice linie dintr-un tabel se nume&#351;te <b><i>record</i></b> (&#238;nregistrare);</li>
                        <li>Intersec&#355;ia dintre o linie &#351;i o coloan&#259; se nume&#351;te <b><i>value</i></b>(valoare).</li>
                        <li>
                            Cea mai important&#259; linie dintr-un tabel este acea linie care define&#351;te tabelul.
                            Ea se nume&#351;te <b><i>cap de tabel</i></b> (sau structura de baz&#259;). Acesta este primul
                            lucru pe care &#238;l cre&#259;m atunci c&#226;nd vrem s&#259; facem un tabel.
                        </li>
                        <li>Capul de tabel con&#355;ine defini&#355;ia coloanelor din tabelul respectiv</li>
                    </ul>
                </p>
            </ol>

            <b><li>Crearea unui tabel</li></b>
            <a href="https://support.microsoft.com/en-us/office/create-a-table-and-add-fields-8fdc65f9-8d40-4ff5-9212-80e6545e8d87">Crearea unui tabel &#351;i ad&#259;ugarea c&#226;mpurilor. </a>
            <ol>
                <p>
                    <b>2.</b> Vom crea un prim tabel numit <b>Clienti</b>. Observa&#355;i c&#259; imediat dup&#259; ce am
                    &#238;nceput s&#259; cre&#259;m baza de date, <b>Access</b> se a&#351;teapt&#259; s&#259; cre&#259;m capul de tabel.
                    Exist&#259; dou&#259; moduri de vizualizare ale unui tabel <img src="img/view.png">
                </p>
                <table>
                    <tr>
                        <td>
                            <p>
                               <b>DatasheetViews</b>,<img src="img/1.2.png"> ce ne permite s&#259; cre&#259;m
                                structura tabelului &#351;i s&#259; introducem datele &#238;n acela&#351;i timp, &#351;i
                            </p>
                        </td>
                        <td>
                            <img src="img/1.3.png">
                        </td>
                    </tr>
                </table>
                <p>
                    <b>Design Views</b>.<img src="img/1.4.png">. <br>
                    &#238;n momentul &#238;n care alegem s&#259; cre&#259;m un tabel &#238;n </br>
                    <b>Design Views</b>, <img src="img/1.4.png">. <b></b> va cere imediat s&#259;
                    introducem numele acestuia. Complet&#259;m numele <b>Clienti</b> şi d&#259;m <b>OK</b>.<br>
                 </p>
                 <p>
                    Complet&#259;m coloanele tabelului, specific&#226;nd tipul de date pentru fiecare coloan&#259; &#238;n
                    parte, astfel:
                    <ul>
                        <li><b>ID_CLIENT</b> coloan&#259; de tip <i><b>AutoNumber</b></i> (Numerotare automat&#259; 1,2,3,…..)</li>
                        <li><b><i>Nume</i></b>, coloan&#259; de tip <i><b>Text</b></i> ;</li>
                        <li><b><i>Oras</i></b>, coloan&#259; de tip <i><b>Text</b></i> ;</li>
                        <li><b><i>Salariu</i></b>, coloan&#259; de tip <b><i>Number</i></b> (Num&#259;r)</li>
                    </ul>
                    (observ&#259;m c&#259; la tipul Number nişte subtipuri de date: alegem <b><i>Longinteger</i></b>- &#238;ntreg lung).
                </p>
            </ol>

            <img src="img/1.5.png">
            <p>
                &#206;n acest moment putem vizualiza tabelul &#238;n modul <b>Datasheet View</b> <br>
                <img src="img/1.2.png"> (ribon-ul contextual <b>Datasheet>Views</b>) pentru a putea introduce &#238;nregistr&#259;rile.</br>
                <img src="img/1.6.png">

                <ul style="text-indent: 0px;">
                    Ap&#259;sa&#259;i <b>YES</b> dac&#259; Access v&#259; cere s&#259; salvați datele.
                    Navigarea de la o valoare la alta se poate face ap&#259;s&#226;nd tasta <b>Tab</b>
                </ul>
            </p>
        </ol>
        </div>
    </body>
</html>