<!DOCTYPE html>
<html lang="en">
    <head>
        <title>Fisa Access 4</title>

            <meta charset="utf-8"> 

            <link rel="stylesheet" href="style.css">
    </head>
    <body>
        <br>
        <div class="box">
            <PageTitle style="text-align:center">
                <h1>
                    <u>F I &#350; A Nr. 4<br></u>
                        Crearea unui formular
                </h1>
            </PageTitle><br>
            <p> 
                    <b>Formularele</b> reprezintă <b>ferestre</b> ce permit <b>adăugarea</b>, <b>modificarea</b>, &#351;i <b>ştergerea</b> datelor dintr-o bază de date. Formularele sunt special create astfel
                    încât să permită, cât mai facil şi rapid, realizarea operaţiilor de mai sus.
            </p>
            <p>Cre&#259;m o nou&#259; baz&#259; de date numit&#259; <bi>Scoala</bi>: <br>
                <img src="img/access4_1.png">
            </p>
            <br> Baza de date va con&#355;ine un tabel <bi>Clase</bi> cu urm&#259;toarele c&#226;mpuri:
           <table> 
                <tr><td><img src="img/access4_2.png"></td><td> C&#226;mpul ID_Clasa este cheie primar&#259;</td></tr> 
            <table> &#351;i c&#226;teva &#238;nregistr&#259;ri: <br><img src="img/access4_3.png">   
        <p>Din ribbon-ul <bi>Create</bi> cre&#259;m un nou tabel <bi>Table</bi> .<img src="img/access3_4.png"> pe care il salv&#259;m <img src="img/access3_5.png"> cu numele <bi>Elevi</bi><br>
        Acest tabel va con&#355;ine urm&#259;toarele c&#226;mpuri:
            <table> 
                <tr><td><img src="img/access4_4.png"></td><td> C&#226;mpul ID_Elev este cheie primar&#259;</td>
                </tr> 
            <table>
             &#351;i c&#226;teva &#238;nregistr&#259;ri: <br><img src="img/access4_5.png"> 
        </p>           
          <p>Pentru a stabili exact rela&#355;ia, adic&#259; pentru a specifica faptul c&#259; datele din c&#226;mpul ID_Clasa din <bi>Clase</bi> este replicat&#259; &#238;n ID_Clasa din <bi>Elevi</bi>, mergem &#238;n <bi>DatabaseTools --> Relationships</bi>. 
                     <br><img src="img/access2_6.png"><br>Select&#259;m ambele tabele &#351;i ap&#259;s&#259;m <b>Add</b>, apoi <b>Close</b>.<br><img src="img/access4_6.png"> 
        </p>
        <p>
             Cele dou&#259; tabele nu sunt &#238;nc&#259; rela&#355;ionate. Tragem (Drag&Drop) coloana ID_Clasa din <bi>Clase</bi> peste coloana ID_Clasa din <bi>Elevi</bi>. <br> &#206;n fereastra deschis&#259; bif&#259;m checkbox-ul <b>Enforce Referential Integrity</b>.<br>
            Ap&#259;s&#259;m <b>Create</b>.<br> <img src="img/access4_7.png">
        </p>
          <p><tot>Aten&#355;ie !</tot> Este obligatoriu s&#259; &#238;nchidem tabelele &#238;nainte de a face aceast&#259; opera&#355;ie de rela&#355;ionare.</p>

        <p>Observ&#259;m c&#259; apare rela&#355;ia '1 la n' (<b>'1 la ∞'</b>).</p>
        <table>
            <tr>
                <td><img src="img/access4_8.png"></td><td>C&#226;mpul ID_Clasa din tabelul <bi>Elevi</bi> este cheie extern&#259;</td> 
            </tr>
        </table>        
        <p>
            Avem dou&#259; tabele: <bi>Clase</bi> &#351;i <bi>Elevi</bi>. Cele dou&#259; tabele sunt rela&#355;ionate: unei
            &#238;nregistr&#259;ri din tabelul <bi>Clase</bi> pot s&#259; îi corespund&#259; mai multe &#238;nregistr&#259;ri din tabelul <bi>Elevi</bi>.
        </p>   
        <p>
            Select&#259;m tabelul <bi>Clase</bi>.<br><img src="img/access4_8_1.png"><br>
            Din ribbon-ul <b>Create</b> alegeţi <bi>Form</bi> pentru crearea unui formular.
        </p>
        <img src="img/access4_9.png">
        
        <p>Ob&#355;inem urm&#259;torul formular care con&#355;ine toate c&#226;mpurile din ambele tabele:</p>
        <img src="img/access4_10.png">
        <p>
            Pentru a salva acest formular se d&#259; click dreapta si <i>Save</i>:<br><img src="img/access4_11.png">.<br> Apoi se d&#259; un nume formularului:<br><img src="img/access4_12.png">
        </p>
        <p>
            Cu acest instrument putem să facem orice operaţie de modificare fără a mai fi nevoie să deschidem ambele tabele. De exemplu, revenind la clasa IX B, apăsăm <b>New Record</b> <img src="img/6.10.png">în tabelul <bi>Elevi</bi>. Introducem Nume, Prenume şi data naşterii.
        </p>
        <img src="img/access4_10_1.png">
        <p>
            În acest moment nu numai că a fost introdus în tabel elevul <i>Preda</i>, dar el a fost asignat clasei <i>IX B</i>. Dacă deschideţi tabelul <bi>Elevi</bi> observaţi noua înregistrare pentru <i>Preda</i>, care are deja la <i>ID_Clasa</i> valoarea <b>1</b> (care reprezintă clasa <i>IX B</i>).
        </p>
        <img src="img/access4_10_3.png">
        <p>În acest Formular nu se pot face numai adăugări de linii noi, dar și                 modificări, sortări, filtrări, s.a.m.d.
        </p>
        <p>
            Similar cre&#259;m un formular pentru tabelul <bi>Elevi</bi> cu ajutorul &#259;ruia putem vizualiza sau insera noi inregistr&#259;ri: 
        </p><img src="img/access4_13.png">
        </div>
    </body>
</html>