<!DOCTYPE html>
<html lang="en">
    <head>
        <title>Inserare</title>
        <style>
            .titlu {
                padding: 8px;
                margin: 25px;

                /* other styling */
                background-color: #33475b;
                border-radius: 10px;
                color: white;
                font-family: colibri;
                font-size: 20pt;
            }
        </style>

        <meta charset="utf-8"> 
        
    </head>
    <body>
        <PageTitle style="text-align:center">
            <u>
                <h1>F I &#350;  A  Nr. 3</h1>
                <h2> Inserarea diferitelor elemente &#238;n pagin&#259;</h2>
            </u>
        </PageTitle><br>

        <ol type="1">
            <li class="titlu"  id="f3_1">1. Inserarea simbolurilor matematice &#351;i a diacriticelor.</li>
            <p> 
                Pe fila <b>Inserare</b> (Insert) din grupul <b>Simboluri</b>(Symbols)<br><img src="imagini/simboluri_1.png"> <br>se alege 
                simbolul dorit: <br><img src="imagini/simboluri_2.png">
            </p>

            <li class="titlu" id="f3_2">2. Inserarea unei ecua&#355;ii matematice(formule).</li>
            <p>
                Pe fila <b>Inserare</b> (Insert) &#238;n grupul <b>Simboluri</b>(Symbols)<br><img src="imagini/ecuatii_1.png"><br> se poate alege o ecua&#355;ie din list&#259; <br><img src="imagini/equation_word_1.png"><br> sau se poate insera o ecua&#355;ie(formula) nou&#259; (Insert New Equation) care se editeaz&#259;  folosind simbolurile cuprinse &#238;n fila Proiectare(Design) care apare:<br><img src="imagini/equation_word_2.png">
            </p>

            <li class="titlu" id="f3_3">3. Inserarea chenarului la pagin&#259;.</li>
                &#206;n fila <b><i>Proiectare</i></b> (Design) grupul <b><i>Fundal pagin&#259;</i></b>(Page Background) da&#355;i click pe Borduri pagin&#259;(Page Borders) :<br><img src="imagini/borduri_word_1.png"><br>Pentru pagini selecta&#355;i Bordur&#259; pagin&#259; (Page Border) din caseta de dialog <b><i>Borduri &#351;i umbriri</i></b>(Borders and Shading) <br><img src="imagini/borduri_word_2.png"><br> &#351;i seta&#355;i propriet&#259;&#355;ile chenarului, Aplic&#259; la (Apply to) &#206;ntreg documentul(Whole Document).
            
            <li class="titlu" id="f3_4">4. Inserarea unei imagini.</li>
            <p>
                Face&#355;i clic &#238;n loca&#355;ia unde dori&#355;i s&#259; insera&#355;i imaginea. &#206;n fila <b>Inserare</b> (Insert) &#238;n grupul Ilustratii (Ilustrations) face&#355;i clic pe <b>Imagine</b> (Pictures) &#351;i &#238;n fereastra care apare selecta&#355;i o imgine &#351;i ap&#259;sa&#355;i butonul <b>Inserare</b> (Insert).<br> Imaginea se poate introduce într-un chenar(Picture Border):<br><img src="imagini/bordura_poza.png"><br> I se poate aplica un efect(Picture Effects):<br><img src="imagini/efecte_poza.png"><br>
                Se poate seta pozi&#355;ia(Position) &#238;n raport cu textul, etc...:<br><img src="imagini/pozitie_poza.png"><br><a href="https://en.wikipedia.org/wiki/Salman_Rushdie">Salman Rushdie</a>
            </p>
            <li class="titlu" id="f3_5">5. Inserarea Smart Art.</li>
            <p>
                SmartArt se referă la gama de elemente grafice disponibile în Word care se poate folosi pentru a crea diagrame, cum ar fi diagrame de flux, diagrame de proces, organigrame și altele asemenea. Selectați o imagine SmartArt din galerie și apoi personalizați-o în funcție de nevoi. SmartArt v&#259; ajut&#259; s&#259; crea&#355;i diagrame cu aspect profesional în câteva minute.
            </p>
            <p>
                Face&#355;i clic &#238;n loca&#355;ia unde dori&#355;i s&#259; insera&#355;i elementul Smart Art. &#206;n fila <b>Inserare</b> (Insert) &#238;n grupul Ilustra&#355;ii (Ilustrations) face&#355;i clic pe <b>Smart Art</b> (Smart Art) :<br><img src="imagini/smart_art_word_1.png"><br> &#351;i &#238;n fereastra care apare selecta&#355;i o categorie din panoul din stânga pentru a vizualiza o serie de aspecte pentru acea categorie în panoul central.  Face&#355;i clic pe un aspect pentru a-l previzualiza în
                panoul din dreapta.<br><img src="imagini/smart_art_word_2.png"><br>După inserarea SmartArt, există câteva lucruri pe care a&#355;i putea dori să le schimbați cu privire la aspectul său. Ori de câte ori selecta&#355;i o imagine SmartArt, filele Design și Format vor apărea în partea dreaptă a Panglicii. De acolo, este ușor să editați stilul și aspectul unui grafic SmartArt.<br><img src="imagini/smart_art_word_3.png"><br>Pentru detalii: <a href="http://www2.westsussex.gov.uk/LearningandDevelopment/IT%20Learning%20Guides/Microsoft%20Word%202010%20-%20Level%203/05%20SmartArt.pdf">Smart Art 1 </a> sau <a href="https://edu.gcfglobal.org/en/word2016/smartart-graphics/1/">Smart Art 2 </a> 
            </p>
            <li class="titlu" id="f3_6">6. Inserarea unui ClipArt &#238;n document.</li>
            <p>
                Face&#355;i clic &#238;n loca&#355;ia &#238;n care dori&#355;i s&#259; ad&#259;uga&#355;i un ClipArt → Fila inserare (Insert) → grupul Ilustra&#355;ii (Ilustrations) → clic pe butonul Imagini Online (Online Pictures)<br>
                <img src="imagini/clip_art_word_1.png"><br>
                Introduce&#355;i un cuvânt sau o expresie pentru a descrie ceea ce c&#259;uta&#355;i, apoi ap&#259;sa&#355;i pe Enter.<br>
                <img src="imagini/clip_art_word_2.png"><br>
                Filtra&#355;i rezultatele după Tip(Type) pentru Clipart.<br>
                <img src="imagini/clip_art_word_3.png"><br>
                Selecta&#355;i o imagine şi clic pe Insert<br>
                <img src="imagini/clip_art_word_4.png">
            </p>
            <li class="titlu" id="f3_7">7. Inserarea Watermark &#238;n document.</li>
            <p>
                Watermark-ul este o poz&#259; sau un text ce apare &#206;n fundalul (background) fiecarei pagini dintr-un document.
                &#206;n fila <b><i>Proiectare</i></b> (Design) grupul <b><i>Fundal pagin&#259;</i></b>(Page Background) da&#355;i click pe  pagin&#259;(Watermark) :<br><img src="imagini/watermark_word_1.png"><br> se poate alege un watermark din list&#259;(Confidential) <br><img src="imagini/watermark_word_2.png"><br> sau se poate insera un watermark personalizat (Custom Watermark) <br><img src="imagini/watermark_word_3.png"><br>Introduce&#355;i un cuvânt sau o expresie pentru a descrie ceea ce c&#259;uta&#355;i, apoi ap&#259;sa&#355;i pe Enter.<br><img src="imagini/watermark_word_4.png"><br>Selecta&#355;i o imagine şi clic pe Insert<br>
                <img src="imagini/watermark_word_5.png"><img src="imagini/watermark_word_7.png"><br>Se ob&#355;ine :<br><img src="imagini/watermark_word_6.png"><br> Pentru detalii : <a href="https://www.itlearning.ro/lectia-05-cum-putem-sa-adaugam-un-watermark-la-un-document-in-word/">Watermark</a>
                
            </p>
            <li class="titlu" id="f3_8">8. Inserarea numerelor de pagin&#259;.</li>
            <p>
                Pe fila <b>Inserare</b> (Insert) &#238;n grupul <b>Antet &amp; Subsol</b>(Header &amp; Footer) se poate alege Num&#259;r de pagin&#259;(Page Number):  <br><img src="imagini/nr_pagina_1.png"><br>&#351;i  din list&#259; se poate alege pozi&#355;ia &#351;i formatul dorit:<br><img src="imagini/nr_pagina_2.png"><br>
            </p>

            <li class="titlu" id="f3_9">9.  APLICA&#354;IE:</li>
                <ol style="list-style: a"> 
                    <li> Lansa&#355;i procesorul de text Microsoft Word</li>
                    <li>Pentru margini alege&#355;i formatarea predefinit&#259; <b>Moderate</b> din list&#259;</li>
                    <li>Insera&#355;i antetul &#351;i subsolul care au fost  salva&#355;i &#238;n galerie la Fisa 1;
                    <li> Scrie&#355;i titlul ECUA&#354;IA DE GRADUL AL DOILEA cu font <B>CASTELLAR</B>, m&#259;rime <b>18</b>, culoare <b>ro&#351;ie</b>(red), subliniat cu linie punctat&#259;, centrat </li>
                    <li>Scrie&#355;i folmula de calcul a r&#259;d&#259;cinilor ecua&#355;iei de gradul doi</li>
                    <li>Sub ecua&#355;ie scrie&#355;i textul: PROGRAM DE VACAN&#354;&#258; cu font <B>ALGERIAN</B>, m&#259;rime <b>18</b>, culoare <b>albastr&#259;</b>(blue), aliniat la dreapta.</li>                
                    <li>Sub acest text insera&#355;i o imagine de vacan&#355;&#259; &#351;i ad&#259;uga&#355;i acesteia o bordur&#259; de tip linie &#238;ntrerupt&#259; de culoare verde de grosime 6 pt &#351;i efect de tip Umbrire(Shadow).</li>
                    <li>&#206;n urm&#259;toarea pagin&#259; insera&#355;i imaginea &#351;i textul urm&#259;tor cu caractere Courier New  m&#259;rimea 12.<br><img src="imagini/turing.png"></li>
                    <li>Insera&#355;i o imagine Clip Art la alegere.</li>
                    <li>&#206;n urm&#259;toarea pagin&#259; realiza&#355;i organigrama de mai jos:<br><img src="imagini/fisa6_1.png">.</li>
                    <li>Insera&#355;i o imagine de fundal(Watermark) la alegere.</li>
                    <li>Insera&#355;i un chenar la pagin&#259; la alegere.</li>
                    <li>Insera&#355;i numere de pagin&#259;.</li>
                </ol>
        </ol>
    </body>
</html>

