<!DOCTYPE html>
<html lang="en">
    <head>
        <title>FisaWord3</title>
        <style>
            #titlu {
                padding: 8px;
                margin: 25px;

                /* other styling */
                background-color: #33475b;
                border-radius: 10px;
                color: white;
                font-family: colibri;
            }
        </style>

        <meta charset="utf-8"> 
        
    </head>
    <body>
        <PageTitle style="text-align:center">
            <u>
                <h1>F I &#350;  A  Nr. 3</h1>
                <h2>Inserare</h2>
            </u>
        </PageTitle><br>

        <ol type="1">
            <table>
                <tr>
                    <td><img src="imagini/3.1.png"></td>
                    <td>
                        <li id="titlu">1. Inserarea unui tabel</li>
                        <ol type="a">
                            <li>Utilizarea &#351;abloanelor pentru tabele</li>
                            <p>Face&#355;i clic unde dori&#355;i s&#259; insera&#355;i un tabel</p>
                            <p>
                                Pe fila <b>Inserare</b> (Insert), &#238;n grupul <b>Tabele</b> (Tables), faceşi clic pe 
                                <b>Tabel</b> (Table),alege&#355;i <b>Tabele rapide</b> (Quick Tables) apoi face&#355;i 
                                clic pe &#351;ablonul dorit.
                            </p>

                            <li>Utilizarea comenzii inserare tabel</li>
                            <p>Face&#355;i clic unde dori&#355;i s&#259; insera&#355;i un tabel</p>
                            <p>
                                Pe fila <b>Inserare</b> (Insert), &#238;n grupul <b>Tabele </b>(Tables), faceşi clic pe 
                                <b>Tabel</b> (Table),alege&#355;i <b>Inserare tabel</b> (Insert Tables) apoi in eticheta 
                                deschis&#259; introduce&#355;i num&#259;rul de coloane (columns) &#351;i num&#259;rul de linii (rows) dorit
                            </p>
                        </ol>
                    </td>
                </tr>
            </table>

            <li id="titlu">2. &#206;mbinare celule</li>
            <p>
                Selecta&#355;i celulele pe care dori&#355;i s&#259; le imbina&#355;i <br>
                Pe fila <b>Aspect</b> (Layout) din grupul de Instrumente Tabel da&#355;i clic pe <b>&#206;mbinare celule</b> 
                (Merge cells). <img src="imagini/3.2.png">
            </p>

            <li id="titlu">3. Scindare celule</li>
            <p>
                Selecta&#355;i celula sau celulele pe care dori&#355;i s&#259; le scinda&#355;i (diviza&#355;i) <br>
                Pe fila <b>Aspect</b> (Layout) din grupul de Instrumente Tabel da&#355;i clic pe <b>Scindare celule</b> 
                (Split cells).<img src="imagini/3.3.png">
            </p>

            <li id="titlu">4. Care sunt Instrumentele Tabel ?</li>
            <p>
                Instrumentele Tabel se g&#259;sesc pe fila <b>Aspect</b> (Layout):
                <img src="imagini/3.4.png">
            </p>

            <li id="titlu">5. Inserarea simbolurilor matematice</li>
            <p> 
                Pe fila <b>Inserare</b> (Insert) din grupul <b>Simboluri</b><img src="imagini/3.5.jpeg"> se alege 
                simbolul dorit.
            </p>

            <li id="titlu">6. Scrierea unei ecua&#355;ii (formule)</li>
            <p>
                Pe fila <b>Inserare</b> (Insert) &#238;n grupul <b>Ecua&#355;iii</b><img src="imagini/3.6.png"> se editeaz&#259; 
                ecua&#355;ia (formula) dorit&#259; folosind simbolurile cuprinse &#238;n grupul Ecua&#355;ii:
                <img src="imagini/3.7.png">
            </p>

            <li id="titlu">7. Conversia &#238;n WordArt a unui text existent</li>
            <table>
                <tr>
                    <td>
                        <p>
                            Selecta&#355;i textul pe care vre&#355;i s&#259;-l converti&#355;i &#238;n WordArt <br>
                            &#206;n fila Inserare (Insert) face&#355;i clic pe<img src="imagini/3.9.png"> &#351;i alege&#355;i grafica <br>
                            dorit&#259; din list&#259;:
                        </p>
                    </td>
                    <td><img src="imagini/3.8.png"></td>
                </tr>
            </table>

            <table>
                <tr>
                    <td><img src="imagini/3.10.jpeg"></td>
                    <td>
                        <li id="titlu">8. Inserarea unei miniaturi</li>
                        <p>
                            Face&#355;i clic &#238;n loca&#355;ia unde dori&#355;i s&#259; insera&#355;i miniatura <br>
                            &#206;n fila <b>Inserare</b> (Insert) &#238;n grupul Ilustra&#355;ii (Ilustrations) face&#355;i clic <br>
                            pe <b>Miniatur&#259;</b> (Clip Art) &#351;i c&#259;uta&#355;i miniatura dorit&#259; folosind cuvinte cheie.
                        </p>
                    </td>
                </tr>
            </table>
            
            <li id="titlu">9. Inserarea unei imagini</li>
            <p>
                Face&#355;i clic &#238;n loca&#355;ia unde dori&#355;i s&#259; insera&#355;i miniatura<br>
                &#206;n fila <b>Inserare</b> (Insert) &#238;n grupul Ilustratii (Ilustrations) face&#355;i clic pe <b>Imagine</b> 
                (Picture) &#351;i &#238;n fereastra care apare selecta&#355;i o imgine &#351;i ap&#259;sa&#355;i butonul <b>Inserare</b> (Insert).
            </p>

            <li id="titlu">APLICA&#354;IE:</li>
                <ol style="font-weight: 400; list-style: none"> 
                    <li><span>&#8680;</span> Lansa&#355;i procesorul de text Microsoft Word</li>
                    <li><span>&#8680;</span> Pentru margini alege&#355;i formatarea predefinit&#259; <b>Wide</b> din list&#259;</li>
                    <li><span>&#8680;</span> Scrie&#355;i titlul ORAR cu font <B>CASTELLAR</B>, m&#259;rime <b>18</b>, culoare <b>red</b>, subliniat, centrat </li>
                    <li><span>&#8680;</span> Insera&#355;i un tabel de 6 coloane &#351;i 7 rânduri &#238;n care scrie&#355;i orarul clasei voastre</li>
                    <li><span>&#8680;</span> &#206;n c&#259;su&#355;a fiec&#259;rei zile din s&#259;pt&#259;mâm&#259; inserta&#355;i câte o miniatur&#259;</li>
                    <li><span>&#8680;</span> Sub tabel scrie&#355;i folmula de calcul a r&#259;d&#259;cinilor ecua&#355;iei de gradul doi</li>
                    <li><span>&#8680;</span> Sub ecua&#355;ie scrie&#351;i textul: PROGRAM DE VACAN&#354;&#258;</li>                
                    <li><span>&#8680;</span> Converti&#355;i acest text in WordArt</li>
                    <li><span>&#8680;</span> Sub acest text insera&#355;i o imagine de vacan&#355;&#259;</li>
                    <li><span>&#8680;</span> Salva&#355;i acest fi&#351;ier cu numele <b>&quot;&#350;coala si vacan&#355;a&quot;</b> .</li>
                </ol>
        </ol>
    </body>
</html>